[
  {
    "questionText": "A group of pupils set up an experiment using the following items: a torch, a screen, a clear glass of water, and a stone. They shone the torch through each material, one at a time, and recorded their observations on the screen. Which material would MOST likely result in a dark shadow being formed on the screen?",
    "options": [
      "Clear glass of water",
      "Stone",
      "A sheet of clear plastic",
      "A thin piece of tracing paper"
    ],
    "correctAnswerIndex": 1,
    "explanation": "A dark shadow is formed when light is blocked. A stone is opaque, meaning it does not allow light to pass through, thus forming a dark shadow. Clear materials like glass, clear plastic, and tracing paper allow some or most of the light to pass through, resulting in faint or no shadows."
  },
  {
    "questionText": "Four pupils, Aisha, Ben, Charles, and Devi, made the following statements about magnets. Only one statement is correct. Which pupil made the correct statement?",
    "options": [
      "Aisha: Magnets can attract all metal objects.",
      "Ben: Magnets lose their magnetism when heated.",
      "Charles: Magnets only attract other magnets.",
      "Devi: The magnetic force of a magnet is strongest at its center."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Ben is correct. Heating a magnet can cause its particles to become disorganized, leading to a loss of magnetism. Aisha is incorrect because magnets only attract certain metals, such as iron, nickel, and cobalt. Charles is incorrect because magnets attract these metals, not just other magnets. Devi is incorrect as magnetic force is strongest at the poles of a magnet, not the center."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "The pupa stage is when the butterfly undergoes significant changes inside a protective covering.",
      "The egg hatches into a larva which feeds and grows.",
      "The adult butterfly lays eggs on any available surface.",
      "The larva sheds its skin several times as it grows."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Butterflies are particular about where they lay their eggs. They typically lay eggs on specific plants that will serve as food for the larva (caterpillar) when it hatches."
  },
  {
    "questionText": "Four pupils made the following statements about magnets. Who made the correct statement?",
    "options": [
      "Ali: Magnets are only found in rectangular shapes.",
      "Ben: All metals are attracted to magnets.",
      "Clara: Magnets can attract through non-magnetic materials.",
      "David: The Earth's North pole attracts the North pole of a magnet."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets can attract through non-magnetic materials like paper or plastic. Not all metals are attracted to magnets (e.g., aluminum). Magnets come in various shapes. Opposite poles attract; like poles repel."
  },
  {
    "questionText": "Which of the following is NOT a function of the skeletal system?",
    "options": [
      "To protect vital organs.",
      "To produce blood cells.",
      "To allow movement.",
      "To digest food."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The skeletal system provides support, protection, and allows movement. It also produces blood cells. Digestion is the function of the digestive system."
  },
  {
    "questionText": "Study the classification table below. Which of the following headings best represent Group A and Group B? \n\n| Group A        | Group B        |\n|----------------|----------------|\n| Fish           | Birds          |\n| Snake          | Mammals        |\n| Crocodile      | Insects        |",
    "options": [
      "Group A: Animals that lay eggs; Group B: Animals that give birth to young alive",
      "Group A: Animals that live on land; Group B: Animals that live in water",
      "Group A: Animals with scales; Group B: Animals with feathers",
      "Group A: Animals that are cold-blooded; Group B: Animals that are warm-blooded"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Fish, snakes, and crocodiles lay eggs. Birds, mammals, and insects, while diverse, all have species that give birth to live young or develop internally within an egg (in the case of some insects)."
  },
  {
    "questionText": "Which of the following is the best conductor of heat?",
    "options": [
      "Wood",
      "Plastic",
      "Iron",
      "Air"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metals are generally good conductors of heat. Iron is a metal, while wood, plastic, and air are insulators."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They can reproduce.",
      "They need air, food and water.",
      "They can make their own food.",
      "They can respond to changes around them."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all living things can make their own food. Plants can through photosynthesis, but animals rely on consuming other organisms."
  },
  {
    "questionText": "A group of pupils conducted an experiment to find out which material absorbs the most water. They used four different materials of the same size and shape and dipped them into a beaker of water. Which of the following is the most suitable aim for their experiment?",
    "options": [
      "To find out which material is the strongest.",
      "To find out which material is the most flexible.",
      "To find out which material is the most waterproof.",
      "To find out which material absorbs the most water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The description of the experiment clearly states that they want to find out which material absorbs the most water."
  },
  {
    "questionText": "What is the main function of the roots of a plant?",
    "options": [
      "To produce food for the plant.",
      "To absorb water and nutrients from the soil.",
      "To attract insects for pollination.",
      "To protect the plant from sunlight."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Roots are primarily responsible for absorbing water and nutrients from the soil, which are essential for the plant's growth."
  },
  {
    "questionText": "Which of the following actions demonstrates the correct way to conserve water?",
    "options": [
      "Watering plants during the hottest part of the day.",
      "Taking long showers.",
      "Repairing leaky faucets promptly.",
      "Leaving the tap running while brushing your teeth."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Repairing leaky faucets prevents water wastage. The other options all lead to unnecessary water consumption."
  },
  {
    "questionText": "Which part of the plant is responsible for reproduction in flowering plants?",
    "options": [
      "Root",
      "Stem",
      "Leaf",
      "Flower"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Flowers are the reproductive organs of flowering plants. They contain the structures necessary for pollination and the development of seeds."
  },
  {
    "questionText": "Four pupils made the following statements about the characteristics of living things. \n\nA: Living things can reproduce.\nB: Living things need air, food, and water.\nC: Living things can move from place to place.\nD: Living things can grow and die.\n\nWhich pupil made the correct statement?",
    "options": [
      "Only A",
      "A, B and D",
      "B and C only",
      "A, B, C, and D"
    ],
    "correctAnswerIndex": 3,
    "explanation": "All the statements A, B, C, and D are characteristics of living things."
  },
  {
    "questionText": "Which of the following statements about fungi are correct?\n\nA: Fungi are non-flowering plants.\nB: Fungi can make their own food.\nC: Fungi can be harmful.\nD: Fungi reproduce from spores.",
    "options": [
      "A and B only",
      "C and D only",
      "A, C and D only",
      "B, C and D only"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fungi are not plants and cannot make their own food. They obtain their food from dead or living organisms. Some are harmful."
  },
  {
    "questionText": "Study the classification table below. Which of the following headings are most suitable for X and Y?\n\n| Living things |\n|---------------|\n|       X       |        Y       |\n|---------------|----------------|\n|    Mushroom   |   Hibiscus     |\n|    Mould      |   Mango Tree   |\n|---------------|----------------|",
    "options": [
      "X: Plants; Y: Animals",
      "X: Animals; Y: Plants",
      "X: Fungi; Y: Plants",
      "X: Plants; Y: Fungi"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Mushrooms and mould are fungi. Hibiscus and mango trees are plants."
  },
  {
    "questionText": "Which one of the following is NOT a characteristic of all living things?",
    "options": [
      "They need air, food and water.",
      "They can grow.",
      "They can respond to changes around them.",
      "They can move from place to place on their own."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Not all living things can move from place to place on their own. Plants, for example, cannot move from place to place."
  },
  {
    "questionText": "Study the classification table below. Which of the following animals is most likely represented by P?\n\n| Animals |\n|---------------|----------------|\n| Can Fly | Cannot Fly |\n|---------------|----------------|\n| Butterfly |     P      |\n| Eagle     |    Tortoise   |\n|---------------|----------------|",
    "options": [
      "Bat",
      "Penguin",
      "Ostrich",
      "Goldfish"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Penguins and ostriches are birds but cannot fly. Goldfish are fish that cannot fly. The bat is a mammal that can fly."
  },
  {
    "questionText": "Which of the following are non-living things that were once living?",
    "options": [
      "A wooden chair and a leather belt.",
      "A plastic ruler and a metal spoon.",
      "A glass bottle and a ceramic plate.",
      "A rubber band and a paper clip."
    ],
    "correctAnswerIndex": 0,
    "explanation": "A wooden chair is made from a tree which was once living. A leather belt is made from animal skin which was once living. Therefore, they were once living things."
  },
  {
    "questionText": "Which of the following statements is true of both plants and animals?",
    "options": [
      "They can make their own food.",
      "They can move freely from place to place.",
      "They need air, food, and water to survive.",
      "They reproduce by spores."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Both plants and animals are living things. All living things need air, food, and water to survive."
  },
  {
    "questionText": "Which of the following shows the life cycle of a plant in the correct order?",
    "options": [
      "Seed → Young plant → Flower → Adult plant",
      "Seed → Flower → Young plant → Adult plant",
      "Flower → Seed → Young plant → Adult plant",
      "Seed → Young plant → Adult plant → Flower"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The life cycle of a plant starts with a seed. The seed germinates into a young plant, which grows into an adult plant. The adult plant then produces flowers, which lead to the formation of new seeds."
  },
  {
    "questionText": "Which of the following groups of materials are all waterproof?",
    "options": [
      "Cotton, paper, and wood",
      "Plastic, glass, and metal",
      "Leather, wool, and silk",
      "Sponge, cloth, and tissue paper"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Plastic, glass and metal do not allow water to pass through them easily, therefore they are waterproof."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the base of a frying pan and why?",
    "options": [
      "Wood because it is a good conductor of heat.",
      "Metal because it is a good conductor of heat.",
      "Plastic because it is a poor conductor of heat.",
      "Rubber because it is a poor conductor of heat."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Metal is a good conductor of heat, allowing the frying pan to heat up quickly and cook food effectively. Wood, plastic, and rubber are poor conductors of heat."
  },
  {
    "questionText": "Which of the following statements about fungi is INCORRECT?",
    "options": [
      "Some fungi are used to make food.",
      "Fungi reproduce by seeds.",
      "Fungi can be both helpful and harmful.",
      "Fungi obtain food from dead or living organisms."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Fungi do not reproduce by seeds. They reproduce by spores."
  },
  {
    "questionText": "John observed a plant growing towards the sunlight. Which characteristic of living things is best demonstrated by this observation?",
    "options": [
      "Living things reproduce.",
      "Living things need air, food, and water.",
      "Living things respond to changes.",
      "Living things grow."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The plant's movement towards sunlight shows it is responding to a change (the presence of sunlight) in its environment."
  },
  {
    "questionText": "Which of the following materials is NOT suitable for making a lampshade?",
    "options": [
      "Paper",
      "Glass",
      "Cloth",
      "Metal"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Metal is opaque and does not allow light to pass through.  A lampshade needs to let light out."
  },
  {
    "questionText": "Ali placed a slice of bread in a sealed plastic bag. He left it in a dark, warm place for a week. What would MOST likely happen to the bread?",
    "options": [
      "It would dry up completely.",
      "It would grow mould.",
      "It would remain the same.",
      "It would turn into soil."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The dark, warm, and moist conditions in the bag are ideal for mould growth."
  },
  {
    "questionText": "Which of the following is NOT a sense organ?",
    "options": [
      "Skin",
      "Heart",
      "Eyes",
      "Ears"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The heart is an organ that pumps blood around the body, but it is not a sense organ. Sense organs detect stimuli from the environment."
  },
  {
    "questionText": "Study the classification table below. \n\nGroup X: Fish, Whale, Dolphin \nGroup Y: Sparrow, Eagle, Penguin\n\nWhich of the following characteristics is used to classify the animals into Group X and Group Y?",
    "options": [
      "Where they live",
      "How they reproduce",
      "What they eat",
      "How they move"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Fish, Whale and Dolphin live in the water while Sparrow, Eagle and Penguin live on land. Reproduction may vary and food habits are diverse. How they move is also not the best fit, as all can swim to some degree."
  },
  {
    "questionText": "Which of the following objects can be attracted by a magnet?",
    "options": [
      "A copper coin",
      "A wooden ruler",
      "An iron nail",
      "A plastic spoon"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets attract materials made of iron, nickel, or cobalt. An iron nail is made of iron."
  },
  {
    "questionText": "What is the main function of the roots of a plant?",
    "options": [
      "To produce food for the plant.",
      "To support the plant and absorb water and minerals.",
      "To attract insects for pollination.",
      "To allow the plant to reproduce."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The main functions of the roots are to anchor the plant in the ground and absorb water and minerals from the soil."
  },
  {
    "questionText": "Which of the following actions demonstrates the property of flexibility?",
    "options": [
      "Breaking a glass bottle.",
      "Bending a metal wire.",
      "Cutting paper with scissors.",
      "Melting an ice cube."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Flexibility is the ability to bend without breaking. Bending a metal wire demonstrates this property."
  },
  {
    "questionText": "Which of the following shows a use of electricity producing light?",
    "options": [
      "A fan spinning.",
      "A light bulb lighting up.",
      "A stove heating up.",
      "A bell ringing."
    ],
    "correctAnswerIndex": 1,
    "explanation": "A light bulb's primary function is to produce light using electricity. The other options use electricity for different purposes like motion or heat."
  },
  {
    "questionText": "Which of the following statements about fungi is NOT true?",
    "options": [
      "Some fungi are edible and nutritious.",
      "Fungi reproduce by spores.",
      "Fungi make their own food through photosynthesis.",
      "Fungi can grow in dark and damp places."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fungi are not plants. They do not have chlorophyll and cannot make their own food through photosynthesis. They obtain nutrients from dead or decaying matter."
  },
  {
    "questionText": "A group of pupils observed that a loaf of bread left in a damp cupboard developed mould faster than a loaf of bread left on the table. What can they conclude from this observation?",
    "options": [
      "Mould grows best in cold environments.",
      "Mould needs air to grow.",
      "Mould needs moisture to grow.",
      "Mould grows best in brightly lit conditions."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The bread in the damp cupboard developed mould faster, indicating that moisture is a key factor in mould growth. The cupboard was likely darker and had less airflow, but the key difference was the presence of moisture."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Wood and plastic are poor conductors of heat, making them suitable for handles. Metal and glass conduct heat readily and the handle would be too hot to hold."
  },
  {
    "questionText": "Which of the following objects does NOT produce light?",
    "options": [
      "A burning candle",
      "The moon",
      "A light bulb",
      "The sun"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The moon reflects light from the sun. It does not produce its own light, unlike a burning candle, a light bulb, or the sun."
  },
  {
    "questionText": "Four children made the following statements. Who described the characteristic of mammals incorrectly?",
    "options": [
      "Ali: Mammals give birth to young.",
      "Bala: Mammals feed their young with milk.",
      "Carol: Mammals have feathers.",
      "David: Mammals have hair or fur."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Mammals have hair or fur, give birth to young (with few exceptions), and feed their young with milk. Feathers are characteristics of birds, not mammals."
  },
  {
    "questionText": "Which of the following actions demonstrates the force of gravity?",
    "options": [
      "A ball rolling on a flat surface eventually stops.",
      "A kite flying high in the sky.",
      "A pen falling to the ground when dropped.",
      "A magnet attracting a paper clip."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Gravity is the force that pulls objects towards the earth. A pen falling to the ground when dropped is a direct demonstration of gravity's pull."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to its environment?",
    "options": [
      "A rock rolling down a hill.",
      "A car stopping at a red light.",
      "A plant growing towards sunlight.",
      "Water freezing into ice."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Living things respond to stimuli in their environment. A plant growing towards sunlight demonstrates this response, as it is actively changing its growth direction based on the presence of light."
  },
  {
    "questionText": "Which of the following statements best describes the function of roots in a plant?",
    "options": [
      "To produce food for the plant.",
      "To transport water and nutrients to the leaves.",
      "To absorb water and nutrients from the soil.",
      "To attract insects for pollination."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The main function of roots is to absorb water and nutrients from the soil, which are essential for the plant's growth and survival."
  },
  {
    "questionText": "Which of the following is NOT a state of matter?",
    "options": [
      "Solid",
      "Liquid",
      "Gas",
      "Energy"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The three common states of matter are solid, liquid, and gas. Energy is not a state of matter but a property or characteristic."
  },
  {
    "questionText": "Which animal is most likely to be found in a polar habitat?",
    "options": [
      "Lion",
      "Polar bear",
      "Monkey",
      "Camel"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Polar bears are adapted to survive in cold, icy conditions. Lions live in grasslands, monkeys in tropical forests and camels in the desert."
  },
  {
    "questionText": "Four students, Siti, Raj, Chloe, and Ming, made the following statements about different animal groups:\n\nSiti: Mammals feed milk to their young.\nRaj: All birds have feathers and lay eggs.\nChloe: Fish use lungs to take in oxygen from the water.\nMing: Snakes are reptiles and they have scales.\n\nWhich of the following students made correct statements?",
    "options": [
      "Siti, Raj, and Ming",
      "Siti and Chloe",
      "Raj and Chloe",
      "Siti, Chloe, and Ming"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Siti's statement is correct; feeding milk to young is a defining characteristic of mammals. Raj's statement is correct; all birds possess feathers and reproduce by laying eggs. Ming's statement is correct; snakes are reptiles, and a key feature of reptiles is having scales. Chloe's statement is incorrect; fish breathe using gills, not lungs, to extract dissolved oxygen from the water."
  },
  {
    "questionText": "Which of the following statements about fungi are correct?\n\nA: All fungi are harmful.\nB: Fungi can reproduce by spores.\nC: Fungi can only grow on living things.\nD: Some fungi are edible.",
    "options": [
      "A and B only",
      "B and D only",
      "A, C and D only",
      "B, C and D only"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Statement A is incorrect, some fungi are edible. Statement B is correct; fungi reproduce by spores. Statement C is incorrect as fungi can grow on dead matter. Statement D is correct; some fungi such as mushrooms are edible."
  },
  {
    "questionText": "Which of the following shows the correct sequence of changes in the life cycle of a flowering plant?",
    "options": [
      "Seed → Young plant → Flower → Fruit",
      "Seed → Flower → Young plant → Fruit",
      "Flower → Seed → Young plant → Fruit",
      "Fruit → Seed → Young plant → Flower"
    ],
    "correctAnswerIndex": 0,
    "explanation": "The life cycle of a flowering plant begins with a seed. The seed germinates into a young plant. The young plant grows into a mature plant and produces flowers. The flower then develops into a fruit containing seeds."
  },
  {
    "questionText": "Which of the following objects are made of only one material?",
    "options": [
      "Wooden chair, glass window, and metal coin",
      "Metal coin, plastic ruler and paper clip",
      "Glass window, wooden chair, and plastic ruler",
      "Paper clip, metal coin and glass window"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A wooden chair may have different materials such as wood, nails, varnish, etc. A plastic ruler may have printed ink or lines and other composite material. A paper clip, metal coin and glass window are made of one material only."
  },
  {
    "questionText": "Four pupils made the following statements about magnets:\n\nA: Magnets can attract all metals.\nB: Magnets have two poles.\nC: The like poles of a magnet repel each other.\nD: Magnets can attract through water.",
    "options": [
      "A and C only",
      "B and D only",
      "B, C and D only",
      "A, C and D only"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Statement A is incorrect; magnets attract magnetic materials such as iron, steel and nickel. Statement B is correct, magnets have two poles (north and south). Statement C is correct, like poles repel. Statement D is correct as magnetic force can act through water."
  },
  {
    "questionText": "Which of the following objects can light pass through completely, allowing you to see clearly through them?",
    "options": [
      "Frosted glass",
      "Clear plastic sheet",
      "Thin cardboard",
      "Wooden block"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Objects that allow light to pass through completely are transparent. Clear plastic sheet is a transparent material, while frosted glass is translucent and the other materials are opaque."
  },
  {
    "questionText": "Which of the following statements about shadows are correct?\n\nA: Shadows are formed when light is blocked by an opaque object.\nB: Shadows are always the same size as the object.\nC: Shadows are darkest when the light source is far away.\nD: Shadows are formed because light travels in straight lines.",
    "options": [
      "A and D only",
      "A, B and C only",
      "B and D only",
      "A, C and D only"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Statement A is correct; shadows are formed when light is blocked. Statement B is incorrect; shadow size varies depending on the light source distance. Statement C is incorrect; shadows are darker when closer to the light source. Statement D is correct; light travels in straight lines, hence creating shadows when blocked."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of living things?",
    "options": [
      "They reproduce.",
      "They need air, food and water.",
      "They respond to changes around them.",
      "They can move from one place to another by themselves."
    ],
    "correctAnswerIndex": 3,
    "explanation": "All living things reproduce, need air, food and water, and respond to changes. However, not all living things can move by themselves (e.g. plants). Locomotion is not a necessary life process."
  },
  {
    "questionText": "Study the classification chart below. Which of the following best represents groups X and Y?\n\nObjects -> Group X (Magnetic) | Group Y (Non-magnetic)",
    "options": [
      "X: Steel Key, Iron Nail; Y: Plastic Ruler, Copper Wire",
      "X: Aluminium Foil, Steel Key; Y: Iron Nail, Plastic Ruler",
      "X: Iron Nail, Copper Wire; Y: Steel Key, Aluminium Foil",
      "X: Plastic Ruler, Copper Wire; Y: Aluminium Foil, Iron Nail"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Magnetic materials are attracted to magnets, usually consisting of iron, steel, nickel, and cobalt. Aluminium foil and copper wire are not ferromagnetic; hence not magnetic materials. Therefore, steel key and iron nail are magnetic materials. Copper wire and plastic ruler are non-magnetic materials."
  },
  {
    "questionText": "Which of the following statements about air is correct?",
    "options": [
      "Air has no mass.",
      "Air occupies space.",
      "Air has no definite shape or size.",
      "Both B and C"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Air occupies space and fills the container that it is in. As such it does not have a definite shape or size. It occupies space and has mass. Therefore the best answer is both B and C."
  },
  {
    "questionText": "A plant is placed in a dark room. After a week, its leaves turn yellow. Which of the following is the MOST likely reason for this change?",
    "options": [
      "The plant received too much water.",
      "The plant did not receive enough sunlight to produce chlorophyll.",
      "The plant was attacked by insects.",
      "The plant was exposed to too much carbon dioxide."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Plants need sunlight to produce chlorophyll, which gives them their green colour. Without sunlight, chlorophyll production decreases, causing the leaves to turn yellow."
  },
  {
    "questionText": "Four different materials were tested for their ability to absorb water. The table below shows the results. Which material is MOST suitable for making a raincoat?",
    "options": [
      "Material A: Absorbed 50ml of water",
      "Material B: Absorbed 10ml of water",
      "Material C: Absorbed 80ml of water",
      "Material D: Absorbed 30ml of water"
    ],
    "correctAnswerIndex": 1,
    "explanation": "A raincoat should be made of a material that absorbs the least amount of water to keep the wearer dry. Material B absorbed only 10ml, making it the most suitable choice."
  },
  {
    "questionText": "Which of the following statements about living and non-living things is ALWAYS true?",
    "options": [
      "Living things can move, while non-living things cannot.",
      "Living things need air, while non-living things do not.",
      "Living things can reproduce, while non-living things cannot.",
      "Living things are bigger than non-living things."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Reproduction is a key characteristic of living things. Non-living things do not reproduce."
  },
  {
    "questionText": "Ali observed four animals. He recorded his observations in a table. Which animal is MOST likely an insect?",
    "options": [
      "Animal P: 4 legs, 2 body parts",
      "Animal Q: 6 legs, 3 body parts",
      "Animal R: 8 legs, 2 body parts",
      "Animal S: 10 legs, many body parts"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Insects typically have 6 legs and 3 body parts (head, thorax, abdomen)."
  },
  {
    "questionText": "A group of pupils set up an experiment to find out if the amount of water affects the height of a plant. Which of the following should they keep the SAME to ensure a fair test?",
    "options": [
      "The amount of water given to each plant.",
      "The type of plant used.",
      "The height of each plant.",
      "The temperature of water."
    ],
    "correctAnswerIndex": 1,
    "explanation": "To ensure a fair test, all variables except the one being tested (amount of water) must be kept constant. Therefore, the type of plant should be kept the same."
  },
  {
    "questionText": "Which of the following is NOT a function of roots?",
    "options": [
      "Absorbing water from the soil",
      "Holding the plant firmly in the ground",
      "Producing food for the plant",
      "Absorbing mineral salts from the soil"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots absorb water and mineral salts and anchor the plant. Food production occurs in the leaves through photosynthesis."
  },
  {
    "questionText": "Which of the following materials is the MOST flexible?",
    "options": [
      "Glass",
      "Wood",
      "Rubber",
      "Metal"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Rubber is a material that can be bent or stretched easily without breaking, making it the most flexible option."
  },
  {
    "questionText": "What happens to water when it is heated?",
    "options": [
      "It melts.",
      "It condenses.",
      "It evaporates.",
      "It freezes."
    ],
    "correctAnswerIndex": 2,
    "explanation": "When water is heated, it changes from a liquid to a gas (water vapour) through evaporation."
  },
  {
    "questionText": "Why is it important to wash our hands before eating?",
    "options": [
      "To make our hands smell nice.",
      "To remove germs that could make us sick.",
      "To make our hands feel cool.",
      "To make our hands look clean."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Washing hands removes harmful germs that can cause illness if ingested."
  },
  {
    "questionText": "Which of the following shows the correct order of the life cycle of a butterfly?",
    "options": [
      "Egg → Pupa → Larva → Adult",
      "Egg → Adult → Larva → Pupa",
      "Egg → Larva → Pupa → Adult",
      "Egg → Pupa → Adult → Larva"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The life cycle of a butterfly consists of four stages: Egg, Larva (caterpillar), Pupa (chrysalis), and Adult (butterfly)."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "The larva eats a lot and grows quickly.",
      "The pupa is a resting stage where significant changes occur.",
      "The adult butterfly lays eggs, continuing the cycle.",
      "The egg hatches directly into a small butterfly."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Butterflies undergo complete metamorphosis. The egg hatches into a larva (caterpillar), not a small butterfly. The larva then becomes a pupa before transforming into an adult butterfly."
  },
  {
    "questionText": "Ali observed a plant. He noticed that the leaves were turning yellow, and the stem was weak. Which of the following is the MOST likely reason for this?",
    "options": [
      "The plant is getting too much sunlight.",
      "The plant is not getting enough water or nutrients.",
      "The plant is being attacked by insects.",
      "The plant is growing too quickly."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Yellowing leaves and a weak stem are common signs of nutrient or water deficiency in plants. Too much sunlight might cause scorching, insect attacks would usually be visible, and rapid growth doesn't typically cause these symptoms."
  },
  {
    "questionText": "Which of these materials is MOST suitable for making a window?",
    "options": [
      "Wood",
      "Metal",
      "Clear Glass",
      "Cardboard"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Clear glass is transparent, allowing light to pass through, which is essential for a window. Wood, metal, and cardboard are opaque and would block light."
  },
  {
    "questionText": "Why do birds migrate to warmer places during winter?",
    "options": [
      "To escape from predators.",
      "To find more food and suitable breeding grounds.",
      "To find a mate.",
      "To enjoy the warmer weather."
    ],
    "correctAnswerIndex": 1,
    "explanation": "While warmer weather is a factor, the primary reason for migration is the availability of food and suitable breeding locations, which are scarce in colder climates during winter."
  },
  {
    "questionText": "What is the main function of roots in a plant?",
    "options": [
      "To produce food for the plant.",
      "To attract insects for pollination.",
      "To absorb water and nutrients from the soil.",
      "To protect the plant from the sun."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The main function of roots is to anchor the plant and absorb water and essential nutrients from the soil, which are then transported to other parts of the plant."
  },
  {
    "questionText": "Which of the following is an example of a non-living thing that was once living?",
    "options": [
      "A rock",
      "A plastic bottle",
      "A wooden chair",
      "A metal spoon"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A wooden chair is made from wood, which comes from trees that were once living. Rocks, plastic bottles and metal spoons are all made from non-living materials and were never alive."
  },
  {
    "questionText": "Which of these actions would BEST help to conserve water?",
    "options": [
      "Taking long showers.",
      "Watering plants during the hottest part of the day.",
      "Turning off the tap while brushing your teeth.",
      "Washing clothes every day, even with a small load."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Turning off the tap while brushing your teeth prevents unnecessary water wastage. The other options lead to more water being used."
  },
  {
    "questionText": "Which part of the plant is responsible for making food?",
    "options": [
      "Roots",
      "Stem",
      "Leaves",
      "Flower"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The leaves are responsible for making food through a process called photosynthesis. They contain chlorophyll, which helps to capture sunlight for this process."
  },
  {
    "questionText": "A group of pupils were asked to classify some animals. Which characteristic is the MOST suitable to group a lion, a tiger, and a cat?",
    "options": [
      "They can fly.",
      "They have feathers.",
      "They are carnivores.",
      "They live in water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Lions, tigers, and cats are all carnivores, meaning they primarily eat meat. This is the characteristic that best groups them together."
  },
  {
    "questionText": "Which of the following statements about magnets is TRUE?",
    "options": [
      "Magnets attract all metals.",
      "Magnets only attract wood.",
      "Like poles of magnets attract each other.",
      "Opposite poles of magnets attract each other."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Magnets only attract specific metals, mainly iron, nickel and cobalt. Opposite poles (North and South) attract each other, while like poles (North and North, or South and South) repel each other."
  },
  {
    "questionText": "A group of pupils observed a plant. They noted that the plant had a weak stem and needed support to grow upright. Which of the following characteristics would best help the plant to climb a wall?",
    "options": [
      "Strong roots",
      "Tendrils",
      "Broad leaves",
      "A thick stem"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Tendrils are specialized structures used by climbing plants to attach themselves to supports. Strong roots help with anchorage but not climbing. Broad leaves are for photosynthesis, and a thick stem would make climbing difficult."
  },
  {
    "questionText": "Which of the following statements about fungi is NOT true?",
    "options": [
      "Some fungi can be eaten.",
      "All fungi are harmful to humans.",
      "Fungi reproduce by spores.",
      "Fungi get their food from dead organisms."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Not all fungi are harmful; some, like mushrooms, are edible. Fungi reproduce through spores and decompose dead organisms for food."
  },
  {
    "questionText": "Four pupils made the following statements about the properties of materials.  A: Wood is waterproof.  B: Metal is a good conductor of heat.  C: Glass is flexible.  D: Rubber is opaque. Which pupils made the correct statement(s)?",
    "options": [
      "A and B only",
      "B and D only",
      "A, C and D only",
      "A, B, C and D"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metal is indeed a good conductor of heat and rubber does not allow light to pass through making it opaque. Wood is not waterproof, and glass is brittle, not flexible."
  },
  {
    "questionText": "Which of the following shows the correct order of the life cycle of a butterfly?",
    "options": [
      "Egg → Pupa → Larva → Adult",
      "Egg → Larva → Pupa → Adult",
      "Pupa → Egg → Larva → Adult",
      "Larva → Egg → Pupa → Adult"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The life cycle of a butterfly starts with an egg, which hatches into a larva (caterpillar). The larva then enters the pupa stage (chrysalis) before finally emerging as an adult butterfly."
  },
  {
    "questionText": "A group of children were playing with magnets. Which of the following actions will cause the magnets to attract each other?",
    "options": [
      "Placing the north pole of one magnet near the north pole of another magnet.",
      "Placing the south pole of one magnet near the south pole of another magnet.",
      "Placing the north pole of one magnet near the south pole of another magnet.",
      "Placing the magnets far apart."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Opposite poles of magnets attract each other. North and North, and South and South poles repel each other. Magnets need to be near to have a visible effect."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to its environment?",
    "options": [
      "A rock rolling down a hill.",
      "A plant growing towards sunlight.",
      "A car starting when the key is turned.",
      "Water freezing into ice."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Living things respond to stimuli in their environment. A plant growing towards sunlight demonstrates this response. The other options involve physical changes or mechanical actions."
  },
  {
    "questionText": "Which of these materials is most suitable to make the base of a cooking pot?",
    "options": [
      "Wood",
      "Plastic",
      "Metal",
      "Glass"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metal is a good conductor of heat, which means it allows heat to pass through it easily. This makes it suitable for the base of a cooking pot. Wood and plastic would melt or burn, while glass is fragile."
  },
  {
    "questionText": "Which of the following statements about air is correct?",
    "options": [
      "Air has a definite shape.",
      "Air has no mass.",
      "Air occupies space.",
      "Air cannot be compressed."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Air occupies space and has mass. It does not have a definite shape and can be compressed."
  },
  {
    "questionText": "What is the main function of the roots of a plant?",
    "options": [
      "To produce food for the plant.",
      "To absorb water and nutrients from the soil.",
      "To attract insects for pollination.",
      "To carry water from the leaves to the stem."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The main function of roots is to absorb water and nutrients from the soil, providing the plant with the resources it needs to grow."
  },
  {
    "questionText": "Which of the following is NOT a source of light?",
    "options": [
      "The Sun",
      "A light bulb",
      "The Moon",
      "A firefly"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The Moon reflects light from the sun; it does not produce its own light. The Sun, a light bulb, and a firefly all emit light."
  },
  {
    "questionText": "Which of the following statements about fungi is NOT true?",
    "options": [
      "Fungi reproduce by spores.",
      "Some fungi are used to make food.",
      "Fungi can only grow in the dark.",
      "Fungi obtain food from dead or decaying matter."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fungi can grow in both light and dark conditions, although some prefer dark, moist environments. Therefore, the statement 'Fungi can only grow in the dark' is not true."
  },
  {
    "questionText": "Four pupils made the following statements about magnets. Which pupil made the correct statement?",
    "options": [
      "Ali: Magnets can attract all types of metal.",
      "Ben: Magnets can attract materials like plastic and wood.",
      "Cindy: Magnets have only one pole.",
      "David: Magnets can attract magnetic materials through non-magnetic materials."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Magnets can attract magnetic materials (like iron, nickel, and cobalt) through non-magnetic materials (like paper, glass, and plastic). Ali is wrong because magnets only attract some metals. Ben is wrong because magnets do not attract plastic or wood. Cindy is wrong because magnets have two poles."
  },
  {
    "questionText": "Which of the following changes of state involves a decrease in heat energy?",
    "options": [
      "Melting",
      "Evaporation",
      "Condensation",
      "Boiling"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Condensation is the change of state from gas to liquid. It involves a decrease in heat energy as the gas molecules lose energy and slow down to form a liquid. The other processes involve an increase in heat energy."
  },
  {
    "questionText": "Study the classification table below. Which of the following is a suitable heading for Group A?",
    "options": [
      "Living things that can make their own food",
      "Non-living things that can move",
      "Living things that can move from place to place",
      "Non-living things that need air, food and water"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Group A consists of plants. Plants are living things that can make their own food through photosynthesis. The other options do not accurately describe plants."
  },
  {
    "questionText": "Which of the following is an example of a physical change?",
    "options": [
      "Burning wood",
      "Rusting of iron",
      "Melting ice",
      "Baking a cake"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Melting ice is a physical change because it changes the state of water from solid to liquid, but it remains water. Burning wood, rusting of iron, and baking a cake are chemical changes because new substances are formed."
  },
  {
    "questionText": "Which part of the plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "Stem",
      "Leaves",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The roots are responsible for absorbing water and nutrients from the soil. The stem provides support, the leaves are for photosynthesis, and the flowers are for reproduction."
  },
  {
    "questionText": "Which of the following materials is the most suitable for making the base of a lamp?",
    "options": [
      "Glass",
      "Metal",
      "Paper",
      "Plastic"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Metal is the most suitable material because it is strong, durable, and can withstand heat. Glass is fragile, paper is flammable, and some plastics might melt."
  },
  {
    "questionText": "Why is it important to separate our waste into different bins for recycling?",
    "options": [
      "To make the bins look colourful.",
      "To make it easier for the garbage collectors.",
      "To reduce pollution and conserve resources.",
      "To make more space in our homes."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Separating waste for recycling helps to reduce pollution by reusing materials, which conserves natural resources and reduces the need for new raw materials."
  },
  {
    "questionText": "Which of the following animals has an outer covering of scales?",
    "options": [
      "Bird",
      "Fish",
      "Mammal",
      "Insect"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Fish are covered with scales, which protect them from the environment. Birds have feathers, mammals have fur or hair, and insects have exoskeletons."
  },
  {
    "questionText": "A plant is placed in a dark room. Which of the following will NOT happen?",
    "options": [
      "The plant will die eventually.",
      "The plant will stop growing.",
      "The plant will turn yellow.",
      "The plant will produce more oxygen."
    ],
    "correctAnswerIndex": 3,
    "explanation": "In the dark, a plant cannot perform photosynthesis, so it cannot produce oxygen. Eventually, it will die, stop growing, and its leaves will turn yellow due to lack of chlorophyll."
  },
  {
    "questionText": "Which of the following statements about living things is NOT true?",
    "options": [
      "All living things can reproduce to create new living things.",
      "All living things need air, food, and water to survive.",
      "All living things can move from one place to another.",
      "All living things can respond to changes around them."
    ],
    "correctAnswerIndex": 2,
    "explanation": "While some living things move (animals), others like plants do not move from place to place. Therefore, not all living things move."
  },
  {
    "questionText": "Ali observed two plants, A and B, over a week. Plant A grew towards the window, while Plant B did not. What characteristic of living things is Ali observing?",
    "options": [
      "Living things can reproduce.",
      "Living things can grow.",
      "Living things can respond to stimuli.",
      "Living things need air, food and water."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plant A is responding to the stimulus of light from the window. This shows that living things can respond to stimuli."
  },
  {
    "questionText": "Which of these materials is most suitable for making the base of a lamp that needs to be waterproof?",
    "options": [
      "Paper",
      "Cloth",
      "Metal",
      "Wood"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metal is waterproof, so water cannot pass through it, making it a suitable material for the lamp base. Paper, cloth and wood all absorb water."
  },
  {
    "questionText": "Which of the following objects is NOT made from a living thing?",
    "options": [
      "A cotton shirt",
      "A wooden chair",
      "A metal spoon",
      "A rubber band"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A metal spoon is made from metal, which is obtained from rocks, which are non-living things. The other options are derived from living things: cotton from the cotton plant, wood from trees, and rubber from rubber trees."
  },
  {
    "questionText": "Which of the following statements is correct about the life cycle of a butterfly?",
    "options": [
      "The larva comes before the egg.",
      "The pupa feeds actively like a larva.",
      "The adult butterfly lays eggs to start the cycle again.",
      "The pupa stage is when the butterfly grows the most."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Adult butterflies lay eggs, which hatch into larva (caterpillar), then pupa (chrysalis), and finally emerge as an adult butterfly. Only the adult butterfly lays eggs."
  },
  {
    "questionText": "Why do we classify things?",
    "options": [
      "To make things look pretty.",
      "To make it easier to find and study them.",
      "To make things more expensive.",
      "To confuse people."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Classification helps us organize things based on their similarities and differences, making it easier to study and locate them."
  },
  {
    "questionText": "Which part of the plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "The stem",
      "The leaves",
      "The roots",
      "The flower"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The roots anchor the plant and absorb water and nutrients from the soil, which are essential for the plant's survival."
  },
  {
    "questionText": "Which of the following shows the correct order in the life cycle of a bean plant?",
    "options": [
      "Seed → Young Plant → Flower → Seedling → Adult Plant",
      "Seed → Seedling → Young Plant → Adult Plant → Flower",
      "Seed → Seedling → Adult Plant → Flower → Young Plant",
      "Seed → Flower → Seedling → Adult Plant → Young Plant"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The correct order is: Seed germinates into Seedling, which grows into Young Plant, which further develops into Adult Plant, which produces Flower (and subsequently seeds)."
  },
  {
    "questionText": "What is the main difference between a rock and a pebble?",
    "options": [
      "A rock is living, and a pebble is non-living.",
      "A rock is bigger, and a pebble is smaller.",
      "A rock is smooth, and a pebble is rough.",
      "A rock is made of metal, and a pebble is made of wood."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The primary difference lies in their size. Rocks are generally larger, while pebbles are smaller, often rounded stones."
  },
  {
    "questionText": "Which animal has a life cycle most similar to that of a chicken?",
    "options": [
      "Butterfly",
      "Frog",
      "Mosquito",
      "Duck"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Both chickens and ducks hatch from eggs and resemble miniature versions of their adult forms. Butterflies, frogs, and mosquitoes undergo metamorphosis, meaning they have distinct larval and pupal stages significantly different from their adult forms."
  },
  {
    "questionText": "A group of pupils set up an experiment using two identical pots of plants. Both pots were placed by the window. They watered both plants with the same amount of water daily. However, they covered one plant with a cardboard box. After a week, they observed that the plant covered with the box had yellow leaves. Which of the following explains their observation?",
    "options": [
      "The plant did not get enough water.",
      "The plant did not get enough nutrients from the soil.",
      "The plant did not get enough sunlight to make food.",
      "The plant was attacked by a disease."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plants need sunlight to perform photosynthesis and produce food. Without enough sunlight, the plant cannot make food and its leaves will turn yellow."
  },
  {
    "questionText": "Four different materials, A, B, C, and D, were tested to see if light could pass through them. The results are shown below:\n\nMaterial A: Most of the light passed through.\nMaterial B: Some of the light passed through.\nMaterial C: No light passed through.\nMaterial D: All of the light passed through.\n\nWhich material is most suitable for making sunglasses?",
    "options": [
      "Material A",
      "Material B",
      "Material C",
      "Material D"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Sunglasses need to block some, but not all, light. Material B allows some light to pass through, making it the most suitable choice."
  },
  {
    "questionText": "John saw an animal in his garden. It had six legs, two antennae, and three body parts. Which group of animals does it belong to?",
    "options": [
      "Mammals",
      "Birds",
      "Insects",
      "Fish"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Insects have six legs, two antennae, and three body parts (head, thorax, and abdomen)."
  },
  {
    "questionText": "Which of the following statements about living things is NOT true?",
    "options": [
      "All living things need air, food, and water.",
      "All living things can reproduce.",
      "All living things can make their own food.",
      "All living things can grow."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Only plants can make their own food through photosynthesis. Animals and fungi obtain food from other sources."
  },
  {
    "questionText": "A baker placed some dough in a warm place. After an hour, the dough had risen. What caused the dough to rise?",
    "options": [
      "The heat caused the dough to expand.",
      "The flour absorbed water and expanded.",
      "The yeast produced a gas.",
      "The dough reacted with the warm air."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Yeast in the dough produces carbon dioxide gas during respiration. This gas gets trapped in the dough, causing it to rise."
  },
  {
    "questionText": "Which of the following materials is the best conductor of heat?",
    "options": [
      "Wood",
      "Plastic",
      "Metal",
      "Cloth"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metals are generally good conductors of heat. Wood, plastic, and cloth are insulators, which do not conduct heat well."
  },
  {
    "questionText": "A group of students observed two animals, Animal X and Animal Y. Animal X has scales, lays eggs, and lives both on land and in water. Animal Y has fur, gives birth to young, and lives only on land. Which groups do Animal X and Animal Y belong to respectively?",
    "options": [
      "Reptile and Mammal",
      "Amphibian and Mammal",
      "Fish and Bird",
      "Insect and Reptile"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Animal X is an amphibian because it has scales, lays eggs, and lives both on land and in water. Animal Y is a mammal because it has fur and gives birth to young."
  },
  {
    "questionText": "Why do birds have hollow bones?",
    "options": [
      "To help them fly.",
      "To keep them warm.",
      "To help them swim.",
      "To protect them from predators."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Hollow bones make birds lighter, which makes it easier for them to fly."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of mammals?",
    "options": [
      "They have fur or hair.",
      "They give birth to live young (except for platypus and echidna).",
      "They feed their young with milk.",
      "They lay eggs."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Mammals generally do not lay eggs, with the exception of the platypus and echidna which are monotremes."
  },
  {
    "questionText": "Which of the following actions demonstrates the force of friction?",
    "options": [
      "A book resting on a table.",
      "A ball rolling to a stop on the ground.",
      "A magnet attracting a paper clip.",
      "A leaf falling from a tree."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Friction is a force that opposes motion when two surfaces rub against each other. The ball rolling to a stop is due to the friction between the ball and the ground."
  },
  {
    "questionText": "Which of the following statements about fungi is INCORRECT?",
    "options": [
      "Some fungi are used in food production.",
      "Fungi reproduce by seeds.",
      "Fungi obtain food from dead organisms.",
      "Some fungi can cause diseases."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Fungi reproduce by spores, not seeds. The other statements are correct; some fungi are edible (e.g., mushrooms), saprophytic (feed on dead matter), and pathogenic (cause disease)."
  },
  {
    "questionText": "Four pupils observed an animal. Ali said, 'It has scales'. Bala said, 'It can fly'. Cindy said, 'It lays eggs'. David said, 'It lives on land'. Which animal were they most likely observing?",
    "options": [
      "A fish",
      "A snake",
      "A bird",
      "A lizard"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Lizards have scales (Ali), lay eggs (Cindy), and live on land (David). While some lizards cannot fly, other lizards can glide short distances (e.g., flying lizards). A fish lives in water, a snake does not fly and a bird does not have scales."
  },
  {
    "questionText": "Which of the following is NOT a function of roots?",
    "options": [
      "Absorbing water",
      "Anchoring the plant",
      "Producing food",
      "Absorbing mineral salts"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots absorb water and mineral salts from the soil and anchor the plant firmly. Food production occurs in the leaves through photosynthesis, not in the roots."
  },
  {
    "questionText": "Which of these materials is most suitable to make the handle of a cooking pot and why?",
    "options": [
      "Metal, because it is a good conductor of heat",
      "Plastic, because it is a poor conductor of heat",
      "Glass, because it is transparent",
      "Wood, because it is a good conductor of electricity"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Plastic is a poor conductor of heat (an insulator), preventing the handle from becoming too hot to hold. Metal is a good conductor, making it unsuitable. Glass is not ideal as it can break and wood does not conduct electricity for cooking pots."
  },
  {
    "questionText": "Which of the following adaptations helps a cactus plant to conserve water in the desert?",
    "options": [
      "Broad leaves",
      "Brightly colored flowers",
      "A thick, fleshy stem",
      "Long, thin roots"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A thick, fleshy stem allows the cactus to store water. Broad leaves would increase water loss through transpiration, brightly colored flowers are for attracting pollinators, and long, thin roots are more about absorbing available water than conserving it."
  },
  {
    "questionText": "Study the classification table below. Which of the following is a suitable heading for Group X and Group Y?\n\n| Group X | Group Y |\n|---|---|\n| Book | Rubber band |\n| Pen | Balloon |\n| Paper | Spring |",
    "options": [
      "Group X: Flexible; Group Y: Not Flexible",
      "Group X: Made of Wood; Group Y: Not made of Wood",
      "Group X: Can be used to write; Group Y: Cannot be used to write",
      "Group X: Rigid; Group Y: Flexible"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Books, pens and paper are generally rigid. Rubber bands, balloons and springs are flexible. Therefore, Group X is Rigid and Group Y is Flexible. The other options do not fit all items in the groups."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to its environment?",
    "options": [
      "A rock rolling down a hill",
      "A plant growing towards sunlight",
      "A car starting when the key is turned",
      "A river flowing to the sea"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Living things respond to stimuli in their environment. A plant growing towards sunlight is an example of this response (phototropism). The other options are examples of physical processes or mechanical actions, not responses by living things."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is correct?",
    "options": [
      "The pupa feeds actively.",
      "The larva resembles the adult butterfly.",
      "The egg hatches into a larva.",
      "The adult butterfly lays eggs on the ground."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The life cycle of a butterfly consists of four stages: egg, larva (caterpillar), pupa (chrysalis), and adult. The egg hatches into a larva. The pupa is in a resting stage and does not feed. The larva looks very different from the adult butterfly. The adult butterfly lays eggs on leaves or stems, not on the ground."
  },
  {
    "questionText": "Which of the following sources of light does NOT use electricity?",
    "options": [
      "A torch light",
      "The Sun",
      "A light bulb",
      "A television screen"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The Sun is a natural source of light and produces light through nuclear fusion, not electricity. A torch light, a light bulb and a television screen all require electricity to produce light."
  },
  {
    "questionText": "Which of the following shows the correct order of changes in state when ice is heated to become steam?",
    "options": [
      "Solid → Gas → Liquid",
      "Solid → Liquid → Gas",
      "Liquid → Solid → Gas",
      "Gas → Liquid → Solid"
    ],
    "correctAnswerIndex": 1,
    "explanation": "When ice (solid) is heated, it first melts into water (liquid). Further heating causes the water to evaporate and become steam (gas)."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "The larva sheds its skin as it grows.",
      "The pupa does not need food as it changes into a butterfly.",
      "The adult butterfly lays its eggs on leaves.",
      "The egg hatches into a pupa."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The egg hatches into a larva (caterpillar), not a pupa directly. The larva then becomes a pupa."
  },
  {
    "questionText": "Four children made the following statements about magnets.  Who made the correct statement?",
    "options": [
      "Ali: Magnets attract all metals.",
      "Bala: Magnets only attract iron.",
      "Cathy: Magnets attract magnetic materials.",
      "David: Magnets only attract steel."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets attract magnetic materials, which include iron, nickel and cobalt. Steel is an alloy containing iron, but magnets also attract other materials."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Wood is a poor conductor of heat, meaning it doesn't transfer heat easily, making it suitable for a cooking pot handle. Metal and glass are good conductors, and some plastics melt at high temperatures."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They need air to survive.",
      "They can reproduce.",
      "They need food to survive.",
      "They can respond to changes around them."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Not all living things need air. For example, some bacteria can survive without air. However, all living things reproduce, need food, and respond to stimuli."
  },
  {
    "questionText": "Which of the following is a source of light but not heat?",
    "options": [
      "A burning candle",
      "The Sun",
      "A light bulb",
      "A firefly"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A firefly produces light through a chemical reaction (bioluminescence) that generates very little heat compared to the other options, which produce both light and significant heat."
  },
  {
    "questionText": "What will happen to an ice cube if you leave it in a warm room?",
    "options": [
      "It will melt into a solid.",
      "It will freeze further.",
      "It will melt into a liquid.",
      "It will turn into a gas directly."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Ice, a solid, will melt into water, a liquid, when exposed to warmth."
  },
  {
    "questionText": "A plant is placed in a dark room. What will happen to its leaves after a week?",
    "options": [
      "They will turn brighter green.",
      "They will turn yellow or pale.",
      "They will grow bigger.",
      "They will fall off."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plants need light to produce chlorophyll, which gives them their green color. Without light, the chlorophyll breaks down, and the leaves turn yellow or pale."
  },
  {
    "questionText": "Which of the following actions demonstrates that plants respond to changes around them?",
    "options": [
      "A seed growing into a plant.",
      "A plant wilting when it is not watered.",
      "A plant producing flowers.",
      "A plant having roots."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Wilting is a response to a lack of water (an environmental change). The plant is showing it needs water to survive. The other options are processes that happen regardless of immediate changes."
  },
  {
    "questionText": "Which of these objects does NOT allow light to pass through?",
    "options": [
      "Clear glass",
      "Tracing paper",
      "A wooden door",
      "Frosted glass"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A wooden door is opaque, meaning it does not allow any light to pass through it. Clear glass is transparent, tracing paper is translucent, and frosted glass is also translucent."
  },
  {
    "questionText": "Which of the following animals is NOT an insect?",
    "options": [
      "Butterfly",
      "Ant",
      "Spider",
      "Grasshopper"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Insects have three body parts (head, thorax, abdomen) and six legs. Spiders are arachnids, having two body parts and eight legs."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is NOT true?",
    "options": [
      "The larva eats a lot and grows quickly.",
      "The pupa is a resting stage where big changes happen.",
      "The adult butterfly lays eggs on any surface.",
      "The caterpillar sheds its skin as it grows."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Butterflies typically lay their eggs on specific host plants that the caterpillars can eat when they hatch, not just any surface."
  },
  {
    "questionText": "Four students made the following statements about magnets. Which statement is correct?",
    "options": [
      "Ali: Magnets can attract all metals.",
      "Bala: Magnets only attract other magnets.",
      "Cindy: Magnets can attract iron.",
      "David: Magnets lose their magnetism when heated."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets can attract materials like iron, nickel and cobalt. Heating can demagnetize a magnet (David is partially correct but Cindy is the most accurate answer)."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They can reproduce.",
      "They can move from place to place.",
      "They need air, food and water.",
      "They can respond to changes around them."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Not all living things can move from place to place. Plants, for instance, cannot move from one location to another."
  },
  {
    "questionText": "A plant is placed in a dark room. Which of the following is LEAST likely to happen?",
    "options": [
      "The plant will die.",
      "The plant will grow taller.",
      "The plant will have yellow leaves.",
      "The plant will not make food."
    ],
    "correctAnswerIndex": 1,
    "explanation": "While the plant will try to grow towards any available light source in a dark room, it will not grow taller in a healthy way. It becomes pale and weak (etiolated) due to lack of light. The other options are more likely."
  },
  {
    "questionText": "Which part of a plant is mainly responsible for absorbing water and minerals from the soil?",
    "options": [
      "Leaves",
      "Stem",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The roots are specifically adapted to absorb water and minerals from the soil through root hairs."
  },
  {
    "questionText": "Which of these materials is the MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Plastic",
      "Cardboard"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plastic is a poor conductor of heat, so it is used to make handles of cooking pots. Metal and glass get very hot very quickly. Cardboard is flammable and can't withstand high temperatures."
  },
  {
    "questionText": "Which of the following animals is an insect?",
    "options": [
      "Spider",
      "Snail",
      "Centipede",
      "Ant"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Insects have three body segments (head, thorax, abdomen), six legs, and usually wings. Spiders are arachnids, snails are mollusks, and centipedes are myriapods."
  },
  {
    "questionText": "Which of these changes is reversible?",
    "options": [
      "Burning of paper",
      "Melting of ice",
      "Rusting of iron",
      "Cooking an egg"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Melting ice is a reversible change because the water can be frozen back into ice. The other options are irreversible."
  },
  {
    "questionText": "What will happen to a shadow if you move the light source further away from an object?",
    "options": [
      "The shadow will become larger.",
      "The shadow will become smaller.",
      "The shadow will become brighter.",
      "The shadow will disappear."
    ],
    "correctAnswerIndex": 1,
    "explanation": "As the light source moves further away, the shadow will become smaller. The light rays will diverge less."
  },
  {
    "questionText": "Why do we wear light-colored clothes on a hot day?",
    "options": [
      "Light-colored clothes absorb more heat.",
      "Light-colored clothes reflect more heat.",
      "Light-colored clothes trap more heat.",
      "Light-colored clothes are cheaper."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Light-colored clothes reflect more sunlight and heat away from the body, keeping us cooler. Dark colors absorb more heat."
  },
  {
    "questionText": "A group of pupils observed four different animals, P, Q, R and S. They recorded their observations in the table below. Which animal is most likely an insect?\n\n| Animal | Number of legs | Number of body parts | Antennae | Wings |\n|---|---|---|---|---| \n| P | 6 | 3 | Yes | Yes |\n| Q | 8 | 2 | No | No |\n| R | 10 | Many | Yes | No |\n| S | 4 | 2 | No | Yes |",
    "options": [
      "P",
      "Q",
      "R",
      "S"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Insects typically have 6 legs, 3 body parts (head, thorax, abdomen), and antennae. Animal P matches these characteristics."
  },
  {
    "questionText": "Sarah placed a loaf of bread in a sealed container and left it on her desk for a week. After a week, she observed mould growing on the bread. Which of the following conditions is NOT necessary for the mould to grow?\n",
    "options": [
      "Air",
      "Light",
      "Moisture",
      "Warmth"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Mould needs air, moisture, and warmth to grow. Light is not a necessary condition for mould growth; it can grow in dark environments as well."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is correct?",
    "options": [
      "The larva resembles the adult butterfly.",
      "The pupa is an active feeding stage.",
      "The egg hatches into a larva.",
      "The adult butterfly lays eggs in water."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The life cycle of a butterfly involves egg, larva (caterpillar), pupa (chrysalis), and adult. The egg hatches into a larva. The larva does not resemble the adult butterfly, and the pupa is a resting stage, not a feeding one. Butterflies lay eggs on plants, not in water."
  },
  {
    "questionText": "Which of these materials is most suitable to make the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Wood is a poor conductor of heat, making it suitable for a cooking pot handle to prevent burns. Metal and glass are good conductors of heat, and some plastics might melt at high temperatures."
  },
  {
    "questionText": "A group of students compared the shadows formed by a ball at different times of the day. They observed that the shadow was shortest at noon. What is the most likely reason for this?",
    "options": [
      "The sun is directly overhead at noon.",
      "The ball absorbs the most light at noon.",
      "The air is cooler at noon.",
      "The Earth is closest to the sun at noon."
    ],
    "correctAnswerIndex": 0,
    "explanation": "When the sun is directly overhead (at its highest point) at noon, the shadow cast by an object is the shortest because the sunlight is shining almost directly down on the object."
  },
  {
    "questionText": "Study the classification table below. Which of the following headings are most suitable for A and B?\n\n| A | B |\n|---|---| \n| Rose | Fern |\n| Hibiscus | Moss |\n| Mango Tree | Algae |",
    "options": [
      "A: Flowering plants, B: Non-flowering plants",
      "A: Plants with fruits, B: Plants without fruits",
      "A: Plants that grow on land, B: Plants that grow in water",
      "A: Big plants, B: Small plants"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Rose, Hibiscus and Mango tree are flowering plants whereas Fern, Moss and Algae are non-flowering plants."
  },
  {
    "questionText": "Which of the following describes what happens to water when it boils?",
    "options": [
      "It changes from a liquid to a solid.",
      "It changes from a gas to a liquid.",
      "It changes from a liquid to a gas.",
      "It changes from a solid to a gas."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Boiling is the process where a liquid (water) changes into a gas (water vapour)."
  },
  {
    "questionText": "Which of the following statements about magnets is correct?",
    "options": [
      "Magnets attract all metals.",
      "Magnets only attract other magnets.",
      "Magnets can attract iron and steel.",
      "Magnets lose their magnetism when heated."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets attract certain metals, specifically iron and steel. They also attract or repel other magnets, depending on the poles facing each other. Heating a magnet can weaken or destroy its magnetism, but the question asks for what is correct."
  },
  {
    "questionText": "What is the main function of roots in a plant?",
    "options": [
      "To produce food for the plant.",
      "To support the plant and absorb water and nutrients.",
      "To attract insects for pollination.",
      "To carry water and nutrients to all parts of the plant."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The primary functions of roots are to anchor the plant in the ground and to absorb water and nutrients from the soil."
  },
  {
    "questionText": "Which of the following actions demonstrates the best way to conserve water?",
    "options": [
      "Taking long showers every day.",
      "Washing the car with a running hose.",
      "Watering plants during the hottest part of the day.",
      "Turning off the tap while brushing your teeth."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Turning off the tap while brushing your teeth prevents unnecessary water wastage, making it the best way to conserve water among the options given."
  },
  {
    "questionText": "Which of the following statements about plants is INCORRECT?",
    "options": [
      "All plants need sunlight, water, and air to survive.",
      "Plants can make their own food through photosynthesis.",
      "All plants have roots, stems, and leaves.",
      "Plants help to clean the air by absorbing carbon dioxide."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all plants have roots, stems and leaves. For example, moss does not have roots, stems or leaves."
  },
  {
    "questionText": "A group of students conducted an experiment to investigate the properties of different materials. They placed Material X, Material Y, and Material Z in a tank of water. Material X floated, Material Y sank, and Material Z dissolved. Which of the following statements is most likely true?",
    "options": [
      "Material X is heavier than water.",
      "Material Y is less dense than water.",
      "Material Z is soluble in water.",
      "Material Z is impermeable."
    ],
    "correctAnswerIndex": 2,
    "explanation": "If Material Z dissolved in water, it means that it is soluble in water."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They can reproduce.",
      "They need air, food, and water.",
      "They can make their own food.",
      "They can respond to changes around them."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Not all living things can make their own food. Animals, for example, need to eat other plants or animals to obtain food."
  },
  {
    "questionText": "Study the classification table below:\n\nGroup A: Fish, Whale, Dolphin\nGroup B: Bird, Butterfly, Bat\n\nWhat characteristics were used to classify these animals?",
    "options": [
      "How they reproduce.",
      "Where they live.",
      "If they can fly.",
      "If they live in water."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Group A consists of animals that live in water. Group B consists of animals that can fly."
  },
  {
    "questionText": "Which of the following is the correct order of the life cycle of a butterfly?",
    "options": [
      "Egg, Pupa, Larva, Adult",
      "Egg, Larva, Pupa, Adult",
      "Larva, Egg, Adult, Pupa",
      "Pupa, Egg, Larva, Adult"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The correct order of the life cycle of a butterfly is egg, larva (caterpillar), pupa (chrysalis), and adult."
  },
  {
    "questionText": "Which of the following materials is most suitable for making a raincoat?",
    "options": [
      "Paper",
      "Cotton",
      "Plastic",
      "Wood"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plastic is waterproof, making it the most suitable material for a raincoat."
  },
  {
    "questionText": "Which of the following statements about magnets is true?",
    "options": [
      "Magnets only attract metal.",
      "Magnets always attract each other.",
      "Magnets have two poles, a north pole and a south pole.",
      "Magnets lose their magnetism when heated."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets have two poles, a north pole and a south pole. Like poles repel and unlike poles attract."
  },
  {
    "questionText": "Which part of the plant absorbs water and mineral salts from the soil?",
    "options": [
      "Leaves",
      "Stem",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The roots are the part of the plant that absorbs water and mineral salts from the soil."
  },
  {
    "questionText": "What is the main function of the lungs?",
    "options": [
      "To pump blood around the body.",
      "To digest food.",
      "To exchange gases (oxygen and carbon dioxide).",
      "To filter waste from the blood."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The main function of the lungs is to exchange gases – to take in oxygen from the air and release carbon dioxide."
  },
  {
    "questionText": "Which of the following shows a non-reversible change?",
    "options": [
      "Melting ice.",
      "Boiling water.",
      "Burning wood.",
      "Dissolving sugar in water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Burning wood is a non-reversible change because you cannot turn the ash and smoke back into wood."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They need air, food and water.",
      "They can reproduce.",
      "They can move from place to place.",
      "They can grow."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all living things can move from place to place. Plants, for example, cannot move from place to place."
  },
  {
    "questionText": "A group of pupils observed four animals, P, Q, R, and S. They recorded their observations in the table below. Which animal is most likely an insect?\n\n| Animal | Number of legs | Has wings | Body parts | \n|---|---|---|---| \n| P | 6 | Yes | 3 | \n| Q | 8 | No | 2 | \n| R | 4 | No | 2 | \n| S | 0 | No | 1 |",
    "options": [
      "P",
      "Q",
      "R",
      "S"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Insects have 6 legs, wings (sometimes), and 3 body parts (head, thorax, abdomen). Therefore, animal P is most likely an insect."
  },
  {
    "questionText": "Which of the following statements about fungi is NOT true?",
    "options": [
      "Fungi are living things.",
      "Fungi can make their own food.",
      "Fungi can be helpful.",
      "Fungi can be harmful."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Fungi cannot make their own food. They obtain food from dead or decaying matter. Some fungi are helpful (like mushrooms we eat), and some are harmful (like mould)."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the base of a frying pan?",
    "options": [
      "Wood",
      "Plastic",
      "Metal",
      "Glass"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metal is a good conductor of heat, allowing the frying pan to heat up quickly and cook food effectively. Wood, plastic, and glass are poor conductors of heat."
  },
  {
    "questionText": "Which of the following describes the life cycle of a butterfly in the correct order?",
    "options": [
      "Egg → Pupa → Larva → Adult",
      "Egg → Larva → Pupa → Adult",
      "Larva → Egg → Pupa → Adult",
      "Pupa → Egg → Larva → Adult"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The life cycle of a butterfly is: Egg → Larva (caterpillar) → Pupa (chrysalis) → Adult (butterfly)."
  },
  {
    "questionText": "Study the classification table below. Which of the following headings best represents groups X and Y?\n\n| Group X | Group Y | \n|---|---| \n| Rose | Cat | \n| Mango Tree | Dog | \n| Fern | Chicken |",
    "options": [
      "X: Animals; Y: Plants",
      "X: Non-living things; Y: Living things",
      "X: Plants; Y: Animals",
      "X: Living things; Y: Non-living things"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Rose, Mango Tree and Fern are plants, while Cat, Dog and Chicken are animals."
  },
  {
    "questionText": "Which of the following is a characteristic of mammals that distinguishes them from birds?",
    "options": [
      "They have feathers.",
      "They lay eggs.",
      "They give birth to live young.",
      "They can fly."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Mammals typically give birth to live young (with a few exceptions like the platypus), while birds lay eggs. Mammals also have fur or hair, while birds have feathers. Although some mammals can fly (bats), not all mammals can, making option D the best answer."
  },
  {
    "questionText": "Which part of a plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "Stem",
      "Leaves",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots are responsible for absorbing water and nutrients from the soil, which are then transported to the rest of the plant."
  },
  {
    "questionText": "What force causes an apple to fall from a tree to the ground?",
    "options": [
      "Magnetism",
      "Friction",
      "Gravity",
      "Air resistance"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Gravity is the force that pulls objects towards the Earth, causing the apple to fall. Magnetism attracts certain metals, friction opposes motion, and air resistance slows down moving objects."
  },
  {
    "questionText": "Which of the following is the BEST example of a renewable resource?",
    "options": [
      "Coal",
      "Oil",
      "Natural Gas",
      "Solar energy"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Renewable resources are those that can be replenished naturally over time. Solar energy comes from the sun, which is a virtually inexhaustible source. Coal, oil, and natural gas are fossil fuels, which are non-renewable because they take millions of years to form."
  },
  {
    "questionText": "Which of the following statements best describes the purpose of having a waxy layer on the upper surface of a leaf?",
    "options": [
      "To attract insects for pollination.",
      "To prevent the leaf from drying out quickly.",
      "To allow the leaf to absorb more sunlight.",
      "To provide support and structure to the leaf."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The waxy layer, or cuticle, is a waterproof covering that reduces water loss from the leaf through evaporation, preventing it from drying out."
  },
  {
    "questionText": "A group of pupils observed that a loaf of bread left in a warm, dark place developed mould faster than a loaf left in a cold, bright place. Which of the following conditions is LEAST important for mould to grow?",
    "options": [
      "Warmth",
      "Darkness",
      "Air",
      "Moisture"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Mould needs warmth, moisture, and air to grow. While mould often grows in dark places, light does not necessarily prevent mould growth, so darkness is the least important factor."
  },
  {
    "questionText": "Ali placed four different objects (A, B, C, and D) on a ramp. He observed how far each object rolled down the ramp. His observations are shown below. Which object is MOST likely made of a material that creates the most friction with the ramp?",
    "options": [
      "Object A rolled the furthest.",
      "Object B rolled a medium distance.",
      "Object C rolled the shortest distance.",
      "Object D rolled a long distance, but not as far as A."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Friction opposes motion. The object that rolled the shortest distance (Object C) experienced the most friction with the ramp, slowing it down the most."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to a change in its environment?",
    "options": [
      "A rock rolling down a hill during a storm.",
      "A sunflower turning its face towards the sun.",
      "A metal bridge expanding on a hot day.",
      "A glass of water evaporating in a warm room."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Responding to changes is a characteristic of living things. The sunflower turning to the sun is a response to light, which helps it to photosynthesize."
  },
  {
    "questionText": "Four different materials were tested for their ability to absorb water. The results are shown in the table below (grams of water absorbed). Which material would be MOST suitable for making a raincoat? Material X: 5g, Material Y: 1g, Material Z: 10g, Material W: 0g",
    "options": [
      "Material X",
      "Material Y",
      "Material Z",
      "Material W"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A raincoat should be waterproof, meaning it should not absorb water. Material W absorbed the least amount of water (0g), making it the most suitable material."
  },
  {
    "questionText": "Which of these animals lays eggs?",
    "options": [
      "Cat",
      "Dog",
      "Platypus",
      "Cow"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A platypus is a mammal but lays eggs, this makes it a monotreme."
  },
  {
    "questionText": "What part of the plant is mainly responsible for absorbing water?",
    "options": [
      "Stem",
      "Roots",
      "Leaves",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The roots are responsible for absorbing water and nutrients from the soil."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "The need for air",
      "Ability to reproduce",
      "Growth and development",
      "Movement from one place to another"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Not all living things move from one place to another (locomotion). For instance, plants do not move in the same way animals do."
  },
  {
    "questionText": "Which of the following materials is the most opaque?",
    "options": [
      "Clear glass",
      "Frosted glass",
      "Tracing paper",
      "Wood"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Opaque materials do not allow light to pass through them. Wood blocks light completely, therefore, it is the most opaque amongst the options."
  },
  {
    "questionText": "What force causes an apple to fall from a tree to the ground?",
    "options": [
      "Magnetic Force",
      "Frictional Force",
      "Gravitational Force",
      "Elastic Force"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Gravity is the force that attracts objects towards each other. It's the force that pulls the apple down from the tree."
  },
  {
    "questionText": "Which of the following statements about fungi is NOT true?",
    "options": [
      "Fungi reproduce by spores.",
      "Some fungi are used in food production.",
      "Fungi can only grow in dark places.",
      "Fungi obtain food from dead organisms."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fungi can grow in both light and dark environments. While some prefer dark, damp conditions, it's not a requirement for all fungi to survive."
  },
  {
    "questionText": "Four children made statements about magnets.  \nAli: Magnets can attract all metal objects.\nBala: Magnets have two poles.\nCindy: Magnets can attract through non-magnetic materials.\nDina: Magnets always point North-South when they come to rest.\n\nWhich child made an INCORRECT statement?",
    "options": [
      "Ali",
      "Bala",
      "Cindy",
      "Dina"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Ali is incorrect because magnets do not attract all metal objects, only ferromagnetic materials like iron, nickel and cobalt. Other metals like aluminum and copper are not attracted."
  },
  {
    "questionText": "Which of the following best describes the function of the roots of a plant?",
    "options": [
      "To produce food for the plant.",
      "To support the plant and absorb water and nutrients.",
      "To attract insects for pollination.",
      "To allow the plant to reproduce."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Roots primarily function to anchor the plant in the ground and to absorb water and minerals from the soil. They do not produce food (leaves do) or attract insects."
  },
  {
    "questionText": "A group of pupils observed that a loaf of bread left in a warm, moist place developed mould. Which of the following conditions is LEAST important for the mould to grow?",
    "options": [
      "Warmth",
      "Moisture",
      "Light",
      "Presence of bread"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Mould needs warmth, moisture, and a food source (the bread) to grow. Light is not a critical factor for its growth; mould can grow in both light and dark conditions."
  },
  {
    "questionText": "Which of the following materials is the MOST suitable for making a raincoat?",
    "options": [
      "Cotton",
      "Wool",
      "Leather",
      "Plastic"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Plastic is waterproof, making it the most suitable material for a raincoat. Cotton and wool absorb water, while leather, although somewhat water-resistant, is not as effective as plastic and can be damaged by excessive moisture."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to its environment?",
    "options": [
      "A rock rolling down a hill.",
      "A plant growing towards sunlight.",
      "Water freezing into ice.",
      "A car starting when the key is turned."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Living things respond to stimuli in their environment. A plant growing towards sunlight is a response to the stimulus of light, demonstrating a characteristic of living things."
  },
  {
    "questionText": "Study the classification table below.\n\n| Group A | Group B |\n|---|---| \n| Dog | Rose | \n| Cat | Mango Tree |\n| Lion | Sunflower |\n\nWhat is a suitable heading for Group A and Group B?",
    "options": [
      "A: Animals, B: Plants",
      "A: Carnivores, B: Herbivores",
      "A: Mammals, B: Flowering plants",
      "A: Pets, B: Farm plants"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Group A consists of different kinds of animals, whereas Group B consists of different kinds of plants. So, 'Animals' is a suitable heading for Group A, and 'Plants' is a suitable heading for Group B."
  },
  {
    "questionText": "Which of the following shows the correct order of the life cycle of a butterfly?",
    "options": [
      "Egg → Pupa → Larva → Adult",
      "Egg → Larva → Pupa → Adult",
      "Larva → Egg → Pupa → Adult",
      "Pupa → Egg → Larva → Adult"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The life cycle of a butterfly consists of four stages: egg, larva (caterpillar), pupa (chrysalis), and adult (butterfly)."
  },
  {
    "questionText": "Why is it important to separate waste materials for recycling?",
    "options": [
      "To make waste look neater.",
      "To reduce pollution and conserve resources.",
      "To create more jobs for people.",
      "To make more space in landfills."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Recycling reduces the need to extract raw materials, which can cause pollution. It also conserves natural resources and reduces the amount of waste sent to landfills, indirectly contributing to the last option."
  },
  {
    "questionText": "Which of the following object(s) can allow light to pass through completely?",
    "options": [
      "A wooden door",
      "A frosted glass window",
      "A clear glass window",
      "A piece of cardboard"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A clear glass window is transparent, meaning it allows light to pass through completely. A wooden door and a piece of cardboard are opaque and do not allow light to pass through. A frosted glass window is translucent, allowing some light to pass through, but not completely."
  },
  {
    "questionText": "Which of the following statements about the human skeleton is INCORRECT?",
    "options": [
      "It protects our internal organs.",
      "It gives our body shape and support.",
      "It allows us to move by working with muscles.",
      "It produces blood cells in the stomach."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The skeleton produces blood cells in the bone marrow, not the stomach. The other statements are correct."
  },
  {
    "questionText": "Study the classification table below:\n\nGroup X: Plants with weak stems\nGroup Y: Plants with strong stems\n\nWhich of the following plants would MOST likely be placed in Group X?",
    "options": [
      "A rose bush",
      "A mango tree",
      "A watermelon plant",
      "A sunflower"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Watermelon plants are creepers, meaning they have weak stems that grow along the ground. Rose bushes, mango trees, and sunflowers have strong stems."
  },
  {
    "questionText": "Which of the following materials is MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Wood is a poor conductor of heat. This means it doesn't heat up easily, making it safe to hold. Metal and glass conduct heat, and some plastics may melt or warp."
  },
  {
    "questionText": "A group of students observed a snail in their school garden. Which of the following characteristics BEST shows that the snail is a living thing?",
    "options": [
      "It has a hard shell.",
      "It moves slowly.",
      "It leaves a trail of slime.",
      "It eats leaves."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Eating leaves demonstrates that the snail needs food to survive, which is a characteristic of living things. The other options are just features of snails."
  },
  {
    "questionText": "Which of the following is NOT a function of roots in a plant?",
    "options": [
      "To absorb water and nutrients.",
      "To hold the plant firmly in the ground.",
      "To produce food for the plant.",
      "To store food for the plant."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots do not produce food. Leaves produce food through photosynthesis. Roots absorb water and nutrients, anchor the plant, and can sometimes store food."
  },
  {
    "questionText": "Ali wants to keep his ice cream frozen for as long as possible during a picnic. Which container would be MOST suitable?",
    "options": [
      "A clear plastic container",
      "A silver foil container",
      "A black metal container",
      "A white styrofoam container"
    ],
    "correctAnswerIndex": 3,
    "explanation": "White styrofoam is a good insulator, meaning it prevents heat from entering and melting the ice cream. Black metal absorbs heat easily."
  },
  {
    "questionText": "What force causes an apple to fall from a tree?",
    "options": [
      "Magnetic force",
      "Gravitational force",
      "Frictional force",
      "Elastic force"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Gravitational force is the force that pulls objects towards the Earth. This is why the apple falls down."
  },
  {
    "questionText": "Which of the following is an example of a non-living thing that was once part of a living thing?",
    "options": [
      "A rock",
      "A plastic toy",
      "A wooden chair",
      "A puddle of water"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A wooden chair is made from wood, which comes from trees. Trees are living things, so the chair was once part of a living thing."
  },
  {
    "questionText": "Which of the following activities does NOT require the use of muscles?",
    "options": [
      "Breathing",
      "Digesting food",
      "Thinking",
      "Walking"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Thinking is a mental process that relies on the brain. Breathing, digesting food, and walking all involve the use of muscles."
  },
  {
    "questionText": "Study the diagram below showing a simple circuit. What would happen if a second bulb was added to the circuit in series (one after the other)?",
    "options": [
      "The bulbs would become brighter.",
      "The bulbs would become dimmer.",
      "One bulb would be brighter than the other.",
      "The bulbs would not light up at all."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Adding a bulb in series increases the resistance in the circuit. This reduces the current flowing through the bulbs, causing them to become dimmer."
  },
  {
    "questionText": "Which of the following statements BEST describes why a bird can fly but a cat cannot, even though both are living things?",
    "options": [
      "Birds are smaller than cats.",
      "Birds have feathers, and cats have fur.",
      "Birds have wings, and cats have legs.",
      "Birds have hollow bones and a streamlined body, while cats have heavier bones and a less aerodynamic shape."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Birds have adaptations like hollow bones and a streamlined body that reduce weight and air resistance, making flight possible. While wings are important, the other adaptations are critical differences from cats."
  },
  {
    "questionText": "Four pupils made the following statements about magnets. Which pupil is correct?",
    "options": [
      "Ali: Magnets only attract iron.",
      "Ben: All metals are attracted to magnets.",
      "Caili: Magnets can attract through non-magnetic materials.",
      "David: Magnets lose their magnetism when heated."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets can attract through non-magnetic materials like paper or plastic. Only some metals (like iron, nickel, and cobalt) are attracted to magnets. Heating a magnet can demagnetize it, but Caili's statement is the most universally true."
  },
  {
    "questionText": "A farmer wants to separate a mixture of sand and rice. Which of the following methods would be MOST efficient?",
    "options": [
      "Dissolving the mixture in water and filtering.",
      "Using a magnet to attract the rice.",
      "Using a sieve with holes large enough for the sand to pass through but small enough to retain the rice.",
      "Evaporating the mixture in the sun."
    ],
    "correctAnswerIndex": 2,
    "explanation": "A sieve is the most efficient method. The size difference between sand and rice allows for easy separation by size. Dissolving and evaporating wouldn't separate them efficiently, and magnets don't attract rice."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They reproduce.",
      "They need air, food and water.",
      "They can make their own food.",
      "They respond to stimuli."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all living things can make their own food. Plants can, through photosynthesis, but animals cannot. All living things need air, food, and water, reproduce, and respond to stimuli."
  },
  {
    "questionText": "A group of pupils observed a plant growing towards a window. This shows that plants can:",
    "options": [
      "move freely from place to place",
      "respond to changes around them",
      "grow bigger in size over time",
      "produce their own food using sunlight"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The plant growing towards the window demonstrates that it is responding to the stimulus of light. While plants grow and produce food, the movement towards the light specifically shows a response."
  },
  {
    "questionText": "Which of the following materials is MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Wood and some types of plastic are poor conductors of heat, making them suitable for handles to prevent burns. Metal and glass conduct heat very well and would become too hot to handle."
  },
  {
    "questionText": "Study the classification table below:\n\nGroup A: Fish, Whale, Dolphin\nGroup B: Bird, Cat, Butterfly\n\nWhat is the MOST likely heading for Group A and Group B?",
    "options": [
      "Group A: Animals that live in water; Group B: Animals that live on land",
      "Group A: Animals that have scales; Group B: Animals that have feathers",
      "Group A: Animals that are mammals; Group B: Animals that have wings",
      "Group A: Animals that lay eggs; Group B: Animals that give birth to young"
    ],
    "correctAnswerIndex": 0,
    "explanation": "Fish, whales, and dolphins all live in water. While whales and dolphins are mammals, fish aren't. Birds, cats, and butterflies generally live on land. Not all animals in Group B have wings (cat). Only some lay eggs in Group A, not all."
  },
  {
    "questionText": "Which of the following is an example of a change of state where heat is ABSORBED?",
    "options": [
      "Water freezing into ice",
      "Water vapour condensing into water",
      "Ice melting into water",
      "Water boiling into steam"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Melting is when solid changes to liquid, requires heat energy to be absorbed. Boiling (liquid to gas) also absorbs heat. Freezing and condensing release heat to the surrounding. Freezing and condensation releases heat."
  },
  {
    "questionText": "Two identical plants were placed in similar pots. Plant A was watered daily and placed in sunlight. Plant B was not watered and placed in a dark room. After a week, Plant B died. What can you conclude from this experiment?",
    "options": [
      "All plants need sunlight to survive.",
      "All plants need water to survive.",
      "Plants need both sunlight and water to survive.",
      "Plants only need water if they are placed in sunlight."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plant B died because it lacked both water and sunlight. The experiment shows that both are essential for survival, not just one or the other. We cannot conclude from this experiment that only water is needed in sunlight, because the plant lacking water died."
  },
  {
    "questionText": "Which of the following object(s) is/are opaque?",
    "options": [
      "A: Clear glass window, B: Frosted glass window, C: Wooden door",
      "A only",
      "C only",
      "B and C only",
      "A, B and C"
    ],
    "correctAnswerIndex": 2,
    "explanation": "An opaque object does not allow light to pass through. A clear glass window is transparent (allows all light to pass through) and a frosted glass window is translucent (allows some light to pass through). A wooden door does not allow any light to pass through, so it is opaque."
  },
  {
    "questionText": "Which of the following statements about plants is NOT true?",
    "options": [
      "Plants need sunlight, water, and air to survive.",
      "Plants can make their own food using photosynthesis.",
      "All plants have flowers and fruits.",
      "Plants help to clean the air by absorbing carbon dioxide."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all plants have flowers and fruits. Some plants, like ferns and mosses, reproduce using spores instead."
  },
  {
    "questionText": "Ali observed two cups, one with soil and a bean seed and another with only cotton wool and a bean seed, both kept moist.  After a week, only the seed in soil germinated. What conclusion can Ali draw?",
    "options": [
      "The seed in cotton wool did not get enough sunlight.",
      "The seed in cotton wool did not get enough air.",
      "The seed in cotton wool did not get enough water.",
      "The soil provides nutrients necessary for germination."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The experiment shows that the soil provides the necessary nutrients for the seed to germinate. The other options were controlled (water & air) or not relevant to the observation (sunlight)."
  },
  {
    "questionText": "Which of these materials is the MOST suitable for making the base of a frying pan and why?",
    "options": [
      "Plastic, because it is cheap.",
      "Wood, because it does not conduct heat.",
      "Metal, because it conducts heat well.",
      "Glass, because it is transparent."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metal is the most suitable material for the base of a frying pan because it is a good conductor of heat, allowing the food to be cooked efficiently."
  },
  {
    "questionText": "A group of students compared the absorbency of four different paper towels (A, B, C, and D). They poured 50ml of water on a table and used each paper towel to soak up the water. Which towel is the MOST absorbent if it leaves the LEAST amount of water?",
    "options": [
      "Towel A, which left 10ml of water.",
      "Towel B, which left 5ml of water.",
      "Towel C, which left 15ml of water.",
      "Towel D, which left 8ml of water."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The most absorbent towel is the one that leaves the least amount of water. Towel B left only 5ml of water, making it the most absorbent among the four towels."
  },
  {
    "questionText": "Which of the following living things reproduces by spores?",
    "options": [
      "Rose",
      "Chicken",
      "Mushroom",
      "Cat"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Mushrooms are fungi that reproduce by releasing spores. Roses reproduce by seeds, chickens by eggs, and cats by giving birth to live young."
  },
  {
    "questionText": "Why do birds fluff up their feathers on a cold day?",
    "options": [
      "To attract a mate.",
      "To keep cool.",
      "To trap air and keep warm.",
      "To make themselves look bigger."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Birds fluff up their feathers to trap air. The trapped air acts as an insulator, helping to keep the bird warm by reducing heat loss."
  },
  {
    "questionText": "Which of the following is NOT a property of magnets?",
    "options": [
      "Magnets attract all metals.",
      "Magnets have two poles.",
      "Magnets can attract or repel each other.",
      "Magnets can be used to make a compass."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Magnets do not attract all metals. They primarily attract iron, nickel, and cobalt. Some metals, like aluminum and copper, are not attracted to magnets."
  },
  {
    "questionText": "What happens to the shadow of an object when the light source is moved further away?",
    "options": [
      "The shadow becomes larger.",
      "The shadow becomes smaller.",
      "The shadow disappears.",
      "The size of the shadow remains the same."
    ],
    "correctAnswerIndex": 1,
    "explanation": "When a light source is moved further away from an object, the shadow becomes smaller. This is because the angle of the light rays hitting the object decreases."
  },
  {
    "questionText": "Why is it important to separate different materials for recycling?",
    "options": [
      "To make the materials heavier.",
      "To make the recycling process easier and more efficient.",
      "To prevent the materials from smelling bad.",
      "To make the materials look nicer."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Separating materials makes the recycling process easier and more efficient. Different materials require different processing methods, and contamination can reduce the quality of the recycled materials."
  },
  {
    "questionText": "Which of the following actions demonstrates how we can reduce the impact of humans on the environment?",
    "options": [
      "Leaving the water running while brushing your teeth.",
      "Throwing litter into the river.",
      "Using public transport instead of driving a car.",
      "Buying new clothes every week."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Using public transport reduces the number of cars on the road, which decreases air pollution and conserves fuel. The other options increase environmental impact."
  },
  {
    "questionText": "Which of the following statements about fungi is NOT true?",
    "options": [
      "Fungi can reproduce through spores.",
      "Some fungi are used in the production of food like bread.",
      "Fungi make their own food through photosynthesis.",
      "Some fungi can cause diseases in plants and animals."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fungi do not make their own food. They obtain nutrients from dead or decaying organic matter or from living organisms. Photosynthesis is how plants make their own food."
  },
  {
    "questionText": "Which of these materials is most suitable for making a window pane to allow maximum light transmission and clear visibility?",
    "options": [
      "Frosted glass",
      "Clear glass",
      "Wood",
      "Metal"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Clear glass allows the most light to pass through it and provides the clearest view. Frosted glass scatters light, wood and metal are opaque and do not allow light through."
  },
  {
    "questionText": "A plant is placed in a dark cupboard. Which of the following is MOST likely to happen after a week?",
    "options": [
      "The plant will grow taller and greener.",
      "The plant will die immediately.",
      "The plant will wilt and turn yellow.",
      "The plant will produce more flowers."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plants need light for photosynthesis to make food. Without light, the plant will not be able to produce food, causing it to wilt and turn yellow due to the lack of chlorophyll production."
  },
  {
    "questionText": "Which of the following animals is NOT an insect?",
    "options": [
      "Ant",
      "Spider",
      "Butterfly",
      "Grasshopper"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Insects have three body segments (head, thorax, and abdomen) and six legs. Spiders have two body segments and eight legs, therefore they are not insects; they are arachnids."
  },
  {
    "questionText": "Why do we wear light-colored clothes on a sunny day?",
    "options": [
      "Light-colored clothes absorb more heat.",
      "Light-colored clothes reflect more heat.",
      "Light-colored clothes are more fashionable.",
      "Light-colored clothes are cheaper."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Light-colored clothes reflect more sunlight and heat, keeping us cooler. Dark-colored clothes absorb more heat, making us feel hotter."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to its environment?",
    "options": [
      "A rock rolling down a hill.",
      "A plant growing towards sunlight.",
      "Water freezing into ice.",
      "A car starting when the key is turned."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Living things respond to stimuli in their environment. A plant growing towards sunlight is an example of this response, demonstrating its need for light to perform photosynthesis."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is correct?",
    "options": [
      "The larva looks exactly like the adult butterfly.",
      "The pupa is an active feeding stage.",
      "The egg hatches into a larva.",
      "The adult butterfly lays its eggs directly on the flower."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The life cycle of a butterfly consists of four stages: egg, larva (caterpillar), pupa (chrysalis), and adult. The egg hatches into a larva, which then transforms into a pupa before becoming an adult."
  },
  {
    "questionText": "What is the main function of the roots of a plant?",
    "options": [
      "To produce food for the plant.",
      "To absorb water and nutrients from the soil.",
      "To attract insects for pollination.",
      "To protect the plant from the sun."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The main function of roots is to anchor the plant in the ground and absorb water and nutrients from the soil.  The leaves produce food and flowers attract insects for pollination."
  },
  {
    "questionText": "Which of these is NOT a property of magnets?",
    "options": [
      "Magnets attract all metals.",
      "Magnets have two poles.",
      "Magnets can attract or repel other magnets.",
      "Magnets can be used to make a compass."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Magnets only attract certain metals, such as iron, nickel, and cobalt.  They do not attract all metals, like gold or aluminum."
  },
  {
    "questionText": "Which of the following actions demonstrates the concept of reducing friction?",
    "options": [
      "Walking on a rough surface.",
      "Adding oil to a bicycle chain.",
      "Wearing rubber-soled shoes.",
      "Pushing a heavy box across a carpet."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Adding oil to a bicycle chain reduces friction between the moving parts, allowing them to move more smoothly. The other options increase friction."
  },
  {
    "questionText": "Which of the following statements is TRUE about the life cycle of a butterfly and a grasshopper?",
    "options": [
      "Both have a pupa stage.",
      "Both undergo complete metamorphosis.",
      "The young of both animals resemble the adult.",
      "A grasshopper nymph does not have wings, while a butterfly larva does not resemble the adult butterfly."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Butterflies undergo complete metamorphosis (egg, larva, pupa, adult). Grasshoppers undergo incomplete metamorphosis (egg, nymph, adult). A nymph resembles the adult but lacks wings. A butterfly larva (caterpillar) looks very different from the adult butterfly."
  },
  {
    "questionText": "Four pupils made the following statements about magnets. Which pupil made a correct statement?",
    "options": [
      "Ali: Magnets are strongest at their centre.",
      "Bala: Magnets can attract all metals.",
      "Cindy: Magnets can only repel other magnets.",
      "David: Magnets can attract objects through non-magnetic materials."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Magnets have poles where the magnetic force is strongest. Magnets attract only magnetic materials (like iron, nickel, cobalt). Magnets can attract and repel other magnets depending on the poles facing each other. Magnets can attract objects through materials like paper or glass, which are non-magnetic."
  },
  {
    "questionText": "Which of the following materials is most suitable to make the main covering (canopy) of a raincoat and why?",
    "options": [
      "Plastic sheet, because it is waterproof.",
      "Cotton cloth, because it is soft.",
      "Thin metal, because it is strong.",
      "Paper towel, because it is light."
    ],
    "correctAnswerIndex": 0,
    "explanation": "The primary function of a raincoat is to keep the user dry by preventing rain from passing through. Therefore, the material must be waterproof. Plastic is a material that resists water, making the plastic sheet the most suitable choice."
  },
  {
    "questionText": "Which of the following shows the correct order of changes in state when ice is heated until it boils?",
    "options": [
      "Melting → Boiling → Evaporation",
      "Boiling → Melting → Evaporation",
      "Melting → Evaporation → Boiling",
      "Melting → Evaporation → Condensation"
    ],
    "correctAnswerIndex": 1,
    "explanation": "When ice (solid) is heated, it first melts into water (liquid). As heating continues, the water evaporates into water vapour (gas) and, at boiling point, evaporation occurs rapidly."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They reproduce.",
      "They need air.",
      "They can make their own food.",
      "They respond to changes around them."
    ],
    "correctAnswerIndex": 3,
    "explanation": "All living things reproduce, need air (though the source and type of air may differ), and respond to stimuli. However, only plants can make their own food through photosynthesis. Animals and fungi obtain food from other sources."
  },
  {
    "questionText": "Study the classification table below. Which of the following is most likely represented by 'X'?",
    "options": [
      "A mushroom",
      "A fern",
      "A moss",
      "A rose"
    ],
    "correctAnswerIndex": 1,
    "explanation": "From the classification table, 'X' is a non-flowering plant that reproduces by spores. Ferns are non-flowering plants that reproduce by spores. Mushrooms are fungi, mosses reproduce by spores but are classified differently based on vascular tissue, and roses are flowering plants."
  },
  {
    "questionText": "Which of the following statements about living things is incorrect?",
    "options": [
      "All living things can survive without taking in air.",
      "Living things can grow bigger over time.",
      "Living things must respond to changes in their surroundings.",
      "Living things need food and water for energy and survival."
    ],
    "correctAnswerIndex": 0,
    "explanation": "The statement is incorrect because all living things need air (or gases like oxygen, or carbon dioxide for plants) to perform respiration and survive. They cannot survive without taking in air."
  },
  {
    "questionText": "A beaker of water is placed in a room. After a few days, the water level in the beaker decreases. Which of the following processes is mainly responsible for this observation?",
    "options": [
      "Condensation",
      "Freezing",
      "Evaporation",
      "Melting"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The water level decreases due to evaporation. Evaporation is the process where a liquid changes into a gas. Condensation is the reverse process, and freezing and melting involve changes of state between solid and liquid."
  },
  {
    "questionText": "Which of the following adaptations primarily helps a penguin stay warm in the extremely cold Antarctic environment?",
    "options": [
      "A dense layer of feathers and a thick layer of fat (blubber).",
      "Long, powerful legs for chasing prey on land.",
      "Large, wide wings to fly high above the snow.",
      "Thin, smooth skin that allows it to quickly dry after swimming."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Penguins live in extremely cold environments. They rely on their dense, oily feathers and a thick layer of insulating fat (blubber) to trap heat close to their body, preventing them from freezing in the icy water and air."
  },
  {
    "questionText": "Why is it important to separate waste materials for recycling?",
    "options": [
      "To make the waste look neater.",
      "To reduce the amount of waste sent to landfills.",
      "To make the waste heavier.",
      "To encourage people to buy more things."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Recycling helps reduce the amount of waste that ends up in landfills, conserving resources and reducing pollution. Separating waste makes the recycling process more efficient. The other options are incorrect reasons for recycling."
  },
  {
    "questionText": "Sarah observed a plant. She noticed that its leaves were always facing the window. Which characteristic of living things is Sarah observing?",
    "options": [
      "Living things need air.",
      "Living things respond to changes.",
      "Living things need food.",
      "Living things can reproduce."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The plant's leaves turning towards the window shows that it is responding to light, which is a change in its environment. This demonstrates the characteristic of living things responding to changes."
  },
  {
    "questionText": "A group of students placed four different materials (A, B, C, and D) in the sun. After an hour, they measured the temperature of each material. The results are shown below:\nMaterial A: 25°C\nMaterial B: 30°C\nMaterial C: 28°C\nMaterial D: 22°C\n\nWhich material is MOST likely a good insulator of heat?",
    "options": [
      "Material A",
      "Material B",
      "Material C",
      "Material D"
    ],
    "correctAnswerIndex": 3,
    "explanation": "An insulator prevents heat from passing through easily. The material with the lowest temperature after being in the sun is likely the best insulator because it absorbed the least amount of heat. Therefore, Material D is the most likely insulator."
  },
  {
    "questionText": "John placed a glass of ice water on a table. After a few minutes, he noticed water droplets forming on the outside of the glass. What process caused the water droplets to form?",
    "options": [
      "Evaporation",
      "Condensation",
      "Melting",
      "Freezing"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Condensation is the process where water vapor in the air cools down and changes into liquid water. The water vapor in the air around the cold glass cooled down and condensed on the outside of the glass."
  },
  {
    "questionText": "Which of the following statements is NOT true about fungi?",
    "options": [
      "Some fungi are edible.",
      "Fungi can reproduce using spores.",
      "Fungi make their own food using chlorophyll.",
      "Fungi help to decompose dead organisms."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fungi do not have chlorophyll and cannot make their own food through photosynthesis. They obtain their food by absorbing nutrients from their surroundings."
  },
  {
    "questionText": "A group of children were playing with a magnet and different objects. They observed that the magnet attracted some objects but not others. Which of the following materials is MOST likely attracted to a magnet?",
    "options": [
      "Aluminum foil",
      "Wooden block",
      "Iron nail",
      "Plastic ruler"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets attract ferromagnetic materials, such as iron. An iron nail is made of iron, so it will be attracted to the magnet."
  },
  {
    "questionText": "Which part of a plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "Leaves",
      "Stem",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots are the part of the plant that grows underground and absorbs water and nutrients from the soil. These are then transported to the rest of the plant."
  },
  {
    "questionText": "Four students made the following statements about the life cycle of a butterfly. Which statement is correct?",
    "options": [
      "The butterfly starts as an adult before laying eggs.",
      "The larva is also known as the pupa.",
      "The pupa is the stage where the butterfly feeds actively.",
      "The egg hatches into a larva."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The life cycle of a butterfly consists of four stages: egg, larva (caterpillar), pupa (chrysalis), and adult butterfly. The egg hatches into a larva."
  },
  {
    "questionText": "Which of the following is a characteristic of mammals that distinguishes them from other animals?",
    "options": [
      "They lay eggs.",
      "They have scales.",
      "They have feathers.",
      "They feed their young with milk."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Mammals are characterized by the presence of mammary glands, which produce milk to feed their young. This is a unique characteristic that distinguishes them from other animals."
  },
  {
    "questionText": "Which of the following actions demonstrates the conservation of water?",
    "options": [
      "Taking long showers.",
      "Watering plants during the hottest part of the day.",
      "Repairing leaky faucets promptly.",
      "Leaving the tap running while brushing teeth."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Repairing leaky faucets promptly helps to prevent water wastage and conserves water resources. The other options involve wasting water."
  },
  {
    "questionText": "Which force causes an apple to fall from a tree to the ground?",
    "options": [
      "Magnetic force",
      "Gravitational force",
      "Frictional force",
      "Elastic force"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Gravitational force is the force that attracts objects with mass towards each other. It is the force that pulls the apple from the tree to the ground."
  },
  {
    "questionText": "Mei placed four different objects (A, B, C, and D) under the Sun. She recorded the temperature of each object every 30 minutes for 2 hours. Which object is likely to be the best absorber of heat?",
    "options": [
      "Object A: Temperature increased by 2°C",
      "Object B: Temperature increased by 5°C",
      "Object C: Temperature increased by 8°C",
      "Object D: Temperature increased by 3°C"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The best absorber of heat will have the highest increase in temperature. Object C showed the greatest increase (8°C), making it the best absorber among the four."
  },
  {
    "questionText": "A group of students observed a plant. They noticed that its leaves were always facing the sunlight. Which characteristic of living things does this demonstrate?",
    "options": [
      "Living things reproduce.",
      "Living things need air, food, and water.",
      "Living things respond to changes.",
      "Living things grow."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The plant's leaves facing sunlight is a response to a change (the presence of light). This demonstrates that living things respond to stimuli in their environment."
  },
  {
    "questionText": "Which of the following is NOT a good conductor of heat?",
    "options": [
      "Copper",
      "Aluminum",
      "Wood",
      "Iron"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Copper, aluminum, and iron are all metals, which are good conductors of heat. Wood is an insulator, meaning it does not conduct heat well."
  },
  {
    "questionText": "Which of the following changes is reversible?",
    "options": [
      "Burning of paper",
      "Melting of ice",
      "Rusting of iron",
      "Baking a cake"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Melting ice is a change of state from solid to liquid. When the liquid water is cooled, it can return to its solid state (ice), making it a reversible change. The other options are irreversible."
  },
  {
    "questionText": "Four students made statements about magnets. Which statement is INCORRECT?",
    "options": [
      "Magnets attract magnetic materials.",
      "Like poles of a magnet repel each other.",
      "All metals are attracted to magnets.",
      "Magnets have two poles: a north pole and a south pole."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all metals are attracted to magnets. Only magnetic materials like iron, nickel, and cobalt are attracted. Other metals like aluminum and copper are not."
  },
  {
    "questionText": "Which of the following objects allows light to pass through completely?",
    "options": [
      "A wooden door",
      "A piece of frosted glass",
      "A clear glass window",
      "A metal sheet"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A clear glass window allows light to pass through completely, making it transparent. The other options are opaque (wooden door, metal sheet) or translucent (frosted glass)."
  },
  {
    "questionText": "A farmer observed that some plants in his field were taller than others. Which of the following could be a reason for the difference in height?",
    "options": [
      "The taller plants received less sunlight.",
      "The shorter plants received more water.",
      "The taller plants received more nutrients from the soil.",
      "The shorter plants were planted closer together."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plants need nutrients from the soil to grow. If some plants receive more nutrients, they are likely to grow taller. The other options are less likely to cause taller growth."
  },
  {
    "questionText": "Which of the following is a characteristic of all insects?",
    "options": [
      "They have eight legs.",
      "They have wings.",
      "They have three body parts.",
      "They live in water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "All insects have three body parts: a head, a thorax, and an abdomen. Not all insects have wings or live in water, and they have six legs (not eight)."
  },
  {
    "questionText": "What is the main function of roots in a plant?",
    "options": [
      "To produce food for the plant.",
      "To transport water and nutrients to the leaves.",
      "To absorb water and nutrients from the soil.",
      "To support the plant and attract insects."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The main function of roots is to absorb water and nutrients from the soil. They also help anchor the plant in the ground."
  },
  {
    "questionText": "Which of the following is a source of light, but NOT a source of heat?",
    "options": [
      "The Sun",
      "A light bulb",
      "A fire",
      "A glow-worm"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Glow-worms produce light through bioluminescence, a chemical reaction that produces light with very little heat. The Sun, light bulbs, and fire all produce both light and heat."
  },
  {
    "questionText": "Which of the following statements BEST describes why a metal spoon feels colder to the touch than a wooden spoon when both are at room temperature?",
    "options": [
      "The metal spoon is actually colder than the wooden spoon.",
      "The metal spoon absorbs more heat from your hand than the wooden spoon.",
      "The metal spoon conducts heat away from your hand faster than the wooden spoon.",
      "The wooden spoon is a better insulator than the metal spoon."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metals are good conductors of heat. They quickly transfer heat away from your hand, making them feel colder. Wood is a poor conductor (an insulator) and does not conduct heat away as quickly."
  },
  {
    "questionText": "A plant is placed in a dark room. After a week, its leaves turn yellow. What is the MAIN reason for this change?",
    "options": [
      "The plant is not getting enough water.",
      "The plant is not getting enough sunlight to make food.",
      "The plant is getting too much carbon dioxide.",
      "The plant is being attacked by a disease."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Plants need sunlight to carry out photosynthesis, the process of making food. Without sunlight, they cannot produce chlorophyll (the green pigment), causing the leaves to turn yellow."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They can reproduce.",
      "They need air, food, and water.",
      "They can move from one place to another.",
      "They can grow."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all living things can move. For example, plants are living things but are rooted in the ground."
  },
  {
    "questionText": "Why is it important to separate recyclable materials from general waste?",
    "options": [
      "To make the waste look neater.",
      "To reduce the amount of waste sent to landfills.",
      "To create more jobs for people.",
      "To make the waste lighter."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Recycling reduces the amount of waste going to landfills, conserving natural resources and reducing pollution."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Plastic",
      "Wood"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Wood and some plastics are poor conductors of heat (insulators), so they will not get too hot to hold, making them suitable for pot handles."
  },
  {
    "questionText": "Which part of the human body works MOST like the roots of a plant?",
    "options": [
      "Mouth",
      "Lungs",
      "Stomach",
      "Small Intestine"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The roots of a plant absorb water and nutrients. The small intestine absorbs nutrients from the digested food. The mouth starts digestion, the lungs facilitate gas exchange and the stomach begins the digestive process."
  },
  {
    "questionText": "What is the MAIN function of the skeleton in the human body?",
    "options": [
      "To digest food.",
      "To protect internal organs.",
      "To pump blood.",
      "To help us breathe."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The skeleton protects vital organs such as the brain (protected by the skull) and the heart and lungs (protected by the rib cage)."
  },
  {
    "questionText": "Which of the following is the BEST example of how animals depend on plants?",
    "options": [
      "Animals use plants for shelter.",
      "Animals use plants for making nests.",
      "Animals use plants for food.",
      "All of the above."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Animals depend on plants for all of these things - shelter, nest building material, and food. Plants are primary producers in most ecosystems."
  },
  {
    "questionText": "Which of the following properties of a material is most important when choosing a material to make a window?",
    "options": [
      "Strength",
      "Transparency",
      "Flexibility",
      "Waterproofness"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Windows need to be transparent so that light can pass through. While strength and waterproofness are important, transparency is the primary requirement."
  },
  {
    "questionText": "Why do we need to wash our hands with soap and water?",
    "options": [
      "To make our hands smell nice.",
      "To remove germs that can make us sick.",
      "To make our hands feel smooth.",
      "To make our hands look cleaner."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Soap and water help to remove germs, which are tiny organisms that can cause diseases. While washing hands does make them look and feel cleaner, the primary reason is to remove germs."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They reproduce.",
      "They grow.",
      "They need air, food and water.",
      "They can make their own food."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Not all living things can make their own food. Plants can, but animals and fungi cannot."
  },
  {
    "questionText": "Which part of a plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "Leaves",
      "Stem",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots anchor the plant and absorb water and nutrients from the soil, which are essential for the plant's growth and survival."
  },
  {
    "questionText": "Which of the following materials is the most suitable for making a raincoat?",
    "options": [
      "Cotton",
      "Paper",
      "Plastic",
      "Wood"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Plastic is waterproof, meaning it does not allow water to pass through. This makes it suitable for a raincoat."
  },
  {
    "questionText": "Which of the following animals has an outer covering of scales?",
    "options": [
      "Bird",
      "Fish",
      "Mammal",
      "Insect"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Fish have scales as an outer covering for protection. Birds have feathers, mammals have fur or hair, and insects have exoskeletons."
  },
  {
    "questionText": "Which of the following is an example of a non-living thing that was once living?",
    "options": [
      "Rock",
      "Water",
      "Wooden chair",
      "Air"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A wooden chair is made from wood, which comes from a tree (a living thing). Therefore, it was once living."
  },
  {
    "questionText": "What is the main function of the lungs in the human body?",
    "options": [
      "To pump blood around the body",
      "To digest food",
      "To filter waste from the blood",
      "To take in oxygen and release carbon dioxide"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The lungs are responsible for the exchange of gases, taking in oxygen from the air and releasing carbon dioxide as waste."
  },
  {
    "questionText": "Which of the following objects is most likely to be attracted to a magnet?",
    "options": [
      "A plastic ruler",
      "A wooden block",
      "An iron nail",
      "A glass marble"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets attract materials containing iron, nickel, or cobalt. An iron nail is made of iron and will be attracted to a magnet."
  },
  {
    "questionText": "Which of the following sources of light is NOT a natural source?",
    "options": [
      "The Sun",
      "A light bulb",
      "Fireflies",
      "Stars"
    ],
    "correctAnswerIndex": 1,
    "explanation": "A light bulb is an artificial source of light, meaning it is man-made. The sun, fireflies, and stars are natural sources of light."
  },
  {
    "questionText": "What will happen to an ice cube if you leave it in a warm room?",
    "options": [
      "It will freeze even harder.",
      "It will melt and turn into water.",
      "It will stay the same.",
      "It will turn into steam directly."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The ice cube will absorb heat from the warm room and melt, changing its state from solid to liquid (water)."
  },
  {
    "questionText": "Why is it important to wash our hands regularly?",
    "options": [
      "To make our hands smell nice.",
      "To remove germs that can make us sick.",
      "To make our hands look cleaner.",
      "To keep our hands dry."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Washing our hands removes germs, such as bacteria and viruses, which can cause illness if they enter our bodies."
  },
  {
    "questionText": "A plant is placed in a dark room. Which of the following is LEAST likely to happen to the plant after a week?",
    "options": [
      "The leaves will turn yellow.",
      "The stem will become weak.",
      "The plant will grow taller.",
      "The plant will produce more flowers."
    ],
    "correctAnswerIndex": 3,
    "explanation": "In a dark room, a plant cannot perform photosynthesis properly. Therefore, it will not have enough energy to produce flowers. The leaves will likely turn yellow due to lack of chlorophyll, and the stem will become weak as it stretches towards any available light source."
  },
  {
    "questionText": "Which of the following statements is TRUE about the life cycle of a butterfly and a frog?",
    "options": [
      "Both lay eggs in water.",
      "Both have a larval stage.",
      "Both undergo incomplete metamorphosis.",
      "Both look like their parents when they hatch."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Both butterflies and frogs undergo metamorphosis. Frogs have tadpoles (larval stage), and butterflies have caterpillars (larval stage). Butterflies and frogs undergo complete metamorphosis. Only the frog lays eggs in water and neither look like their parents when they hatch."
  },
  {
    "questionText": "Four children made the following statements about magnets. Which child is correct?",
    "options": [
      "Ali: Magnets can attract all types of metal.",
      "Ben: Magnets can only attract magnetic materials.",
      "Cai: Magnets lose their magnetism when heated.",
      "Devi: Magnets have only one pole."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets only attract magnetic materials like iron, nickel, and cobalt. Heating a magnet can cause it to lose its magnetism. Magnets have two poles: a north pole and a south pole."
  },
  {
    "questionText": "Which of the following is NOT a good practice for conserving water?",
    "options": [
      "Taking shorter showers.",
      "Watering plants during the hottest part of the day.",
      "Fixing leaky taps promptly.",
      "Using a watering can instead of a hose."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Watering plants during the hottest part of the day leads to more water loss through evaporation. It is better to water plants in the early morning or late evening."
  },
  {
    "questionText": "Which of the following materials is most suitable for making a transparent window?",
    "options": [
      "Wood",
      "Metal",
      "Glass",
      "Cardboard"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Glass is transparent, allowing light to pass through it, making it suitable for windows. Wood, metal, and cardboard are opaque, meaning they do not allow light to pass through."
  },
  {
    "questionText": "Which part of the human body is responsible for pumping blood around the body?",
    "options": [
      "Lungs",
      "Heart",
      "Brain",
      "Stomach"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The heart is a muscular organ that pumps blood throughout the body, delivering oxygen and nutrients to cells and removing waste products."
  },
  {
    "questionText": "A group of pupils planted some seeds in four different pots. They placed the pots in the same location, but watered them differently. Which of the following variables did they change?",
    "options": [
      "Type of seed",
      "Amount of water",
      "Type of soil",
      "Location of pots"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The pupils changed the amount of water each pot received, making this the variable that was changed (manipulated). The other options were kept the same to ensure a fair test."
  },
  {
    "questionText": "Which of the following statements best describes the function of roots in a plant?",
    "options": [
      "To produce food for the plant.",
      "To support the plant and absorb water and nutrients.",
      "To attract insects for pollination.",
      "To protect the plant from sunlight."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots anchor the plant in the ground and absorb water and nutrients from the soil. Leaves produce food, flowers attract insects, and the plant has various adaptations to protect itself from sunlight (e.g., waxy leaves)."
  },
  {
    "questionText": "Which of the following is an example of a living thing responding to its environment?",
    "options": [
      "A rock being eroded by wind.",
      "A plant growing towards sunlight.",
      "Water freezing into ice.",
      "A metal rusting."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Living things respond to stimuli in their environment. A plant growing towards sunlight is a direct response to its environment, maximizing its ability to perform photosynthesis. The other options are non-living things undergoing physical or chemical changes."
  },
  {
    "questionText": "Why is it important to wash our hands with soap and water before eating?",
    "options": [
      "To make our hands smell nice.",
      "To remove germs that can make us sick.",
      "To make our hands look cleaner.",
      "To cool down our hands."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Washing hands with soap and water is crucial to remove germs (bacteria, viruses) that can cause illness if ingested. While it might also make hands look cleaner and smell better, the primary reason is to prevent the spread of disease."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is NOT true?",
    "options": [
      "A butterfly lays eggs on a leaf.",
      "A caterpillar sheds its skin as it grows.",
      "A pupa does not need food.",
      "A caterpillar hatches from a pupa."
    ],
    "correctAnswerIndex": 3,
    "explanation": "A caterpillar hatches from an egg, not a pupa. The pupa is the stage that comes after the caterpillar stage."
  },
  {
    "questionText": "Which of the following materials is most suitable for making a raincoat?",
    "options": [
      "Cotton",
      "Leather",
      "Plastic",
      "Wool"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Plastic is waterproof, which means it does not allow water to pass through. Therefore, it's the most suitable material for making a raincoat."
  },
  {
    "questionText": "Which part of a plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "Stem",
      "Leaves",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Roots are the part of the plant that grows underground and absorbs water and nutrients from the soil."
  },
  {
    "questionText": "What will happen to an ice cube if you leave it in a warm room?",
    "options": [
      "It will get colder.",
      "It will stay the same.",
      "It will melt and turn into water.",
      "It will turn into a solid block."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Ice is a solid form of water. When heated (in a warm room), it will melt and change into its liquid form, which is water."
  },
  {
    "questionText": "Which of these animals is a mammal?",
    "options": [
      "Lizard",
      "Snake",
      "Whale",
      "Frog"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Whales are mammals because they are warm-blooded, give birth to live young, and feed their young with milk."
  },
  {
    "questionText": "Which of the following is NOT a source of light?",
    "options": [
      "The Sun",
      "A light bulb",
      "The Moon",
      "A firefly"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The Moon reflects light from the Sun; it does not produce its own light. The Sun, a light bulb, and a firefly all produce their own light."
  },
  {
    "questionText": "Which force causes an apple to fall from a tree to the ground?",
    "options": [
      "Magnetic force",
      "Frictional force",
      "Gravitational force",
      "Elastic force"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Gravitational force is the force that pulls objects towards each other. The Earth's gravity pulls the apple towards the ground."
  },
  {
    "questionText": "Which of these materials is the best conductor of heat?",
    "options": [
      "Wood",
      "Plastic",
      "Metal",
      "Cloth"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Metals are generally good conductors of heat, meaning they allow heat to pass through them easily. Wood, plastic, and cloth are insulators, which resist the flow of heat."
  },
  {
    "questionText": "Which of the following is an example of a non-living thing?",
    "options": [
      "A cat",
      "A tree",
      "A rock",
      "A mushroom"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A rock does not grow, reproduce, need food, or breathe. Therefore, it is a non-living thing. A cat, tree and mushroom are living things."
  },
  {
    "questionText": "Which part of the human body helps us to breathe?",
    "options": [
      "Heart",
      "Brain",
      "Lungs",
      "Stomach"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The lungs are the main organs of the respiratory system and are responsible for taking in oxygen and releasing carbon dioxide, which is how we breathe."
  },
  {
    "questionText": "Which of the following statements BEST describes the difference between a rock and a mineral?",
    "options": [
      "A rock is made of only one type of mineral, while a mineral is made of many types of rocks.",
      "A rock is a naturally occurring solid made of one or more minerals, while a mineral has a specific chemical composition and crystal structure.",
      "A rock is formed from living things, while a mineral is formed from non-living things.",
      "A rock is always harder than a mineral."
    ],
    "correctAnswerIndex": 1,
    "explanation": "A rock is an aggregate of one or more minerals, and minerals have a defined chemical composition and crystalline structure. Options A, C, and D are incorrect as they misrepresent the relationship between rocks and minerals and their formation."
  },
  {
    "questionText": "A group of pupils observed that a slice of bread left in a warm, moist environment developed mould faster than a slice left in a cold, dry environment. Which of the following is the MOST likely conclusion?",
    "options": [
      "Mould does not need air to grow.",
      "Mould reproduces by seeds.",
      "Mould grows best in warm and moist conditions.",
      "Mould is a plant."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The experiment demonstrates that mould thrives in warm, moist conditions. The other options are either incorrect about the properties/requirements of mould or not directly supported by the experiment's results."
  },
  {
    "questionText": "Which of the following materials is MOST suitable for making the base of a cooking pot?",
    "options": [
      "Plastic, because it is lightweight.",
      "Wood, because it is a poor conductor of heat.",
      "Metal, because it is a good conductor of heat.",
      "Glass, because it is transparent."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Metal is a good conductor of heat, which allows heat from the stove to efficiently transfer to the food being cooked. The other materials are unsuitable because they are poor conductors of heat or would melt/burn at cooking temperatures."
  },
  {
    "questionText": "Ali observed a caterpillar on a plant. He recorded his observations over several weeks. Which of the following observations would indicate that the caterpillar is a living thing?",
    "options": [
      "The caterpillar stayed on the same plant for three days.",
      "The caterpillar moved to a different part of the plant.",
      "The caterpillar's colour changed from green to brown.",
      "The caterpillar grew larger each week."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Growth is a key characteristic of living things. While movement, changing location, and colour change might occur, growth is a fundamental process demonstrating life. Therefore, growing larger each week is the best indication."
  },
  {
    "questionText": "Which of the following statements about the water cycle is INCORRECT?",
    "options": [
      "Evaporation is when water turns into water vapour.",
      "Condensation is when water vapour turns into liquid water.",
      "Precipitation is when water vapour falls back to Earth as rain, snow, or hail.",
      "Transpiration is when plants release water vapour into the air."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Precipitation is liquid water (rain) or solid water (snow, hail, etc.) falling back to earth, not water vapour. The water vapour has already condensed into liquid/solid form by the time precipitation occurs. Options A, B and D are correct statements."
  },
  {
    "questionText": "Why is it important to separate materials for recycling?",
    "options": [
      "To make them look neater in the recycling bin.",
      "To reduce the amount of waste sent to landfills.",
      "To make it easier to burn the waste.",
      "To increase the cost of recycling."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Recycling aims to reduce landfill waste by processing used materials into new products. Separating materials ensures higher quality recycled materials and reduces contamination. Options A, C and D are incorrect reasons for recycling."
  },
  {
    "questionText": "Which of the following is NOT a function of roots in a plant?",
    "options": [
      "Anchoring the plant in the ground.",
      "Absorbing water and nutrients from the soil.",
      "Producing food for the plant through photosynthesis.",
      "Storing food for the plant."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Photosynthesis, the process of making food for the plant, occurs in the leaves, not the roots. Roots anchor the plant, absorb water and nutrients, and can store food. Option C is therefore the incorrect function of roots."
  },
  {
    "questionText": "Study the food chain below: Grass → Grasshopper → Frog → Snake → Eagle. Which organism is both a predator and a prey?",
    "options": [
      "Grass",
      "Grasshopper",
      "Frog",
      "Snake"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A predator hunts and eats other animals, while prey is the animal being hunted. The frog eats grasshoppers (making the grasshopper its prey) and is eaten by snakes (making the frog the snake's prey). Therefore, the frog is both a predator and prey."
  },
  {
    "questionText": "Which of the following changes of state requires heat energy to be removed?",
    "options": [
      "Melting",
      "Evaporation",
      "Condensation",
      "Boiling"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Condensation is the change from gas (water vapour) to liquid (water). For this to happen, the water vapour needs to cool down, meaning heat energy must be removed. Melting, evaporation and boiling require heat energy to be added."
  },
  {
    "questionText": "Two magnets are placed near each other. In which situation would the magnets repel?",
    "options": [
      "When the north pole of one magnet is placed near the south pole of the other.",
      "When the magnets are placed far apart.",
      "When the south pole of one magnet is placed near the south pole of the other.",
      "When only one magnet is present."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets repel when like poles (north-north or south-south) are placed near each other. Unlike poles attract. Magnets need to be close to interact, and one magnet alone cannot repel or attract anything. Thus, placing the south pole near the south pole would cause repulsion."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "A butterfly's life cycle consists of four stages: egg, larva, pupa, and adult.",
      "The larva stage, also known as a caterpillar, focuses primarily on growth and eating.",
      "The pupa stage is when the larva transforms into a butterfly inside a protective covering.",
      "Butterflies lay their eggs exclusively on brightly colored flowers to ensure the best food source for the adult butterfly."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Butterflies lay their eggs on specific host plants that the caterpillars can eat. These plants aren't always brightly colored flowers."
  },
  {
    "questionText": "Ali observed a plant with weak stems growing upwards by winding itself around a supporting stick. What characteristic of living things is best demonstrated by this observation?",
    "options": [
      "Living things reproduce.",
      "Living things respond to stimuli.",
      "Living things need air, food and water.",
      "Living things grow."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The plant's winding around the stick demonstrates its response to the stimulus of touch or physical support. This helps it to obtain sunlight."
  },
  {
    "questionText": "Which of the following materials is the MOST suitable for making the handle of a cooking pot and why?",
    "options": [
      "Metal, because it is a good conductor of heat.",
      "Glass, because it is transparent.",
      "Plastic, because it is a poor conductor of heat.",
      "Wood, because it is heavy and strong."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Plastic is a poor conductor of heat, meaning it doesn't transfer heat easily. This makes it suitable for a pot handle to prevent burns."
  },
  {
    "questionText": "Four pupils made the following statements about magnets. Who made the CORRECT statement?",
    "options": [
      "Ahmad: Magnets attract all metal objects.",
      "Ben: Magnets only attract objects made of iron and steel.",
      "Cindy: Magnets attract aluminum and copper.",
      "David: Magnets do not attract any metals."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets primarily attract ferrous metals, which include iron and steel. While some alloys may be weakly magnetic, aluminum and copper are not significantly attracted."
  },
  {
    "questionText": "Which of the following best describes the MAIN difference between a living thing and a non-living thing?",
    "options": [
      "Living things are bigger than non-living things.",
      "Living things need air, food and water but non-living things do not.",
      "Living things are more colourful than non-living things.",
      "Living things are only found outdoors."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Living things require sustenance like air, food, and water to survive, grow, and carry out life processes, while non-living things do not have these requirements."
  },
  {
    "questionText": "During a lesson on plants, Miss Tan told the students not to eat any parts of the plants they collected unless an adult confirmed it was safe. Which of the following statements best explains why this safety rule is important?",
    "options": [
      "Some plants or plant parts can be poisonous if eaten.",
      "Eating the plants will make the plants unable to grow properly.",
      "Plant parts might have dirt and insects that make them taste bad.",
      "It is against the school rules to eat during a science lesson."
    ],
    "correctAnswerIndex": 0,
    "explanation": "In nature, many plants look harmless but contain toxins or poisons that can cause illness, injury, or death if ingested. Therefore, it is a crucial safety rule in science to never eat unknown plant parts."
  },
  {
    "questionText": "A group of students were investigating the shadows cast by different objects. They used a torch as a light source. Which of the following changes would make the shadow of an object appear SMALLER?",
    "options": [
      "Moving the object closer to the torch.",
      "Moving the object further away from the torch.",
      "Moving the torch further away from the object.",
      "Using a larger object."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Moving the torch further away from the object will cause the light rays to become more parallel, which in turn reduces the size of the shadow."
  },
  {
    "questionText": "Which of the following shows the correct order of processes involved in the water cycle?",
    "options": [
      "Evaporation → Condensation → Precipitation → Collection",
      "Condensation → Evaporation → Precipitation → Collection",
      "Precipitation → Evaporation → Condensation → Collection",
      "Collection → Precipitation → Evaporation → Condensation"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The water cycle begins with evaporation (water turning into vapor), followed by condensation (water vapor turning into liquid), then precipitation (water falling back to earth), and finally collection (water gathering in bodies of water)."
  },
  {
    "questionText": "Which of the following statements is true about microorganisms?",
    "options": [
      "All microorganisms are harmful.",
      "Microorganisms can only be seen with the naked eye.",
      "Some microorganisms are helpful in making food.",
      "Microorganisms only live in water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Some microorganisms, like bacteria, are used in the production of foods such as yogurt and cheese."
  },
  {
    "questionText": "Which of these objects is the MOST transparent?",
    "options": [
      "A wooden door",
      "A frosted glass window",
      "A clear glass window",
      "A sheet of tracing paper"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A clear glass window allows the most light to pass through without scattering, making it the most transparent option."
  },
  {
    "questionText": "A group of students observed a pond. They noticed many plants with broad, flat leaves floating on the surface. Which of the following is the MOST likely reason for the shape of these leaves?",
    "options": [
      "To attract more insects for pollination.",
      "To reduce water loss through transpiration.",
      "To absorb more sunlight for photosynthesis.",
      "To provide shade for the fish below."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Broad, flat leaves have a larger surface area, allowing them to capture more sunlight for photosynthesis, which is essential for the plant's food production."
  },
  {
    "questionText": "Mei placed a metal spoon, a wooden chopstick, and a plastic ruler in a container of hot water. After 5 minutes, she touched the end of each object that was NOT in the water. Which object would feel the warmest?",
    "options": [
      "The metal spoon",
      "The wooden chopstick",
      "The plastic ruler",
      "They would all feel the same temperature."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Metal is a good conductor of heat, meaning it transfers heat quickly. Therefore, the metal spoon would conduct the heat from the hot water to the other end faster than wood or plastic."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They reproduce.",
      "They need air.",
      "They grow.",
      "They can make their own food."
    ],
    "correctAnswerIndex": 3,
    "explanation": "While plants can make their own food through photosynthesis, animals and other organisms cannot. Therefore, the ability to make their own food is not a characteristic of all living things."
  },
  {
    "questionText": "A farmer observed that his crops were not growing well. He noticed that the leaves were turning yellow. Which of the following is the MOST likely missing element for the plant's growth?",
    "options": [
      "Water",
      "Sunlight",
      "Minerals",
      "Carbon Dioxide"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Yellowing leaves (chlorosis) are often a sign of a mineral deficiency, particularly nitrogen, which is essential for chlorophyll production, the green pigment in plants that helps with photosynthesis."
  },
  {
    "questionText": "Which of the following statements BEST describes the function of roots in a plant?",
    "options": [
      "To produce food for the plant.",
      "To transport water and nutrients to the leaves.",
      "To absorb water and nutrients from the soil.",
      "To protect the plant from insects."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots primarily absorb water and nutrients from the soil, which are then transported to other parts of the plant. They also anchor the plant in the ground."
  },
  {
    "questionText": "Which of these materials is MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Plastic",
      "Wood"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Wood is a poor conductor of heat, making it suitable for a cooking pot handle as it will not get as hot as other materials, preventing burns."
  },
  {
    "questionText": "Why do birds puff up their feathers in cold weather?",
    "options": [
      "To attract a mate.",
      "To appear larger to predators.",
      "To create an insulating layer of air.",
      "To fly more easily."
    ],
    "correctAnswerIndex": 2,
    "explanation": "By puffing up their feathers, birds trap a layer of air close to their bodies. This layer of air acts as insulation, helping to keep them warm by reducing heat loss."
  },
  {
    "questionText": "Which of the following is NOT a source of light?",
    "options": [
      "The Moon",
      "A light bulb",
      "The Sun",
      "A firefly"
    ],
    "correctAnswerIndex": 0,
    "explanation": "The Moon reflects light from the Sun, it does not produce its own light. A light bulb, the Sun, and a firefly all produce their own light."
  },
  {
    "questionText": "A student compared the shadows of a tree at different times of the day. At noon, the shadow was the shortest. Why is this so?",
    "options": [
      "The sun is directly overhead.",
      "The sun is lower in the sky.",
      "The tree has absorbed most of the sunlight.",
      "There are more clouds at noon."
    ],
    "correctAnswerIndex": 0,
    "explanation": "When the sun is directly overhead (at noon), the light rays are hitting the object from directly above, resulting in a shorter shadow. When the sun is lower in the sky, the light rays hit the object at an angle, resulting in a longer shadow."
  },
  {
    "questionText": "Which of the following actions demonstrates the BEST way to conserve water?",
    "options": [
      "Taking long showers.",
      "Watering plants during the hottest part of the day.",
      "Repairing leaky faucets promptly.",
      "Washing the car every day."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Repairing leaky faucets prevents water wastage, which is the best way to conserve water among the given options. The other options waste water unnecessarily."
  },
  {
    "questionText": "Four different cups made of different materials (P, Q, R, and S) were filled with the same amount of hot water. The temperature of the water in each cup was measured over time. The results are shown below:\n\nCup P: Temperature decreased by 5°C in 10 minutes.\nCup Q: Temperature decreased by 10°C in 10 minutes.\nCup R: Temperature decreased by 2°C in 10 minutes.\nCup S: Temperature decreased by 8°C in 10 minutes.\n\nWhich cup is most likely made of a material that is a good insulator of heat?",
    "options": [
      "Cup P",
      "Cup Q",
      "Cup R",
      "Cup S"
    ],
    "correctAnswerIndex": 2,
    "explanation": "A good insulator will prevent heat loss. Cup R showed the smallest temperature decrease, indicating it lost the least amount of heat, therefore it is the best insulator."
  },
  {
    "questionText": "A group of students observed four different animals in the school garden. They recorded their observations in the table below:\n\nAnimal A: Has six legs, has wings, lays eggs\nAnimal B: Has four legs, has fur, gives birth to young\nAnimal C: Has two legs, has feathers, lays eggs\nAnimal D: Has no legs, has scales, lays eggs\n\nWhich animal is most likely a mammal?",
    "options": [
      "Animal A",
      "Animal B",
      "Animal C",
      "Animal D"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Mammals typically have fur or hair and give birth to live young (exceptions exist, but for Primary 3, this is a good general rule)."
  },
  {
    "questionText": "Two similar plants were placed in identical pots with the same type of soil. Plant X was placed near a window, while Plant Y was placed in a dark cupboard. Both plants were watered equally. What is the most likely difference observed after one week?",
    "options": [
      "Plant X will have more leaves.",
      "Plant Y will have more roots.",
      "Plant X will be taller and greener.",
      "Plant Y will be shorter and greener."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plants need sunlight to make food through photosynthesis. Plant X, with sunlight, will grow taller and greener. Plant Y will likely be pale and spindly."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They need air, food and water",
      "They reproduce",
      "They can move from place to place",
      "They respond to changes around them"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Not all living things can move from place to place (e.g., plants). All living things need air, food and water, reproduce, and respond to stimuli."
  },
  {
    "questionText": "Ali conducted an experiment to find out which material is the strongest. He hung weights on strings made of different materials until they broke. Here are his results:\n\nString A: Broke with 500g\nString B: Broke with 750g\nString C: Broke with 250g\nString D: Broke with 600g\n\nWhich string was the strongest?",
    "options": [
      "String A",
      "String B",
      "String C",
      "String D"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The strongest string is the one that can hold the most weight before breaking. String B held 750g, which is the most."
  },
  {
    "questionText": "Which of the following actions demonstrates the concept of 'reduce' in the 3Rs (Reduce, Reuse, Recycle)?",
    "options": [
      "Buying a reusable water bottle instead of disposable plastic bottles.",
      "Using old newspapers to wrap presents.",
      "Sorting plastic bottles for recycling.",
      "Donating old clothes to a charity."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Reducing means creating less waste in the first place. Buying a reusable water bottle reduces the need for disposable plastic bottles."
  },
  {
    "questionText": "Which of the following statements about magnets is always true?",
    "options": [
      "Magnets are made of iron.",
      "Magnets can attract all metals.",
      "Magnets have two poles.",
      "Magnets are only used in compasses."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets always have two poles (North and South). Magnets are not always made of iron, and they only attract specific metals (ferromagnetic metals)."
  },
  {
    "questionText": "A shadow is formed when an object blocks light. Which of the following properties of the object most affects the darkness of the shadow?",
    "options": [
      "The color of the object",
      "The size of the object",
      "The shape of the object",
      "The transparency of the object"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The transparency of the object determines how much light passes through it. A transparent object will cast a faint shadow, while an opaque object will cast a dark shadow."
  },
  {
    "questionText": "Which of the following is a life cycle stage that a butterfly goes through, but a chicken does not?",
    "options": [
      "Egg",
      "Larva",
      "Adult",
      "Young Chick"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Butterflies go through complete metamorphosis, including a larval stage (caterpillar). Chickens do not have a larval stage."
  },
  {
    "questionText": "During an experiment, a student observed that a glass of water left in the sun slowly disappeared. What process caused the water to disappear?",
    "options": [
      "Melting",
      "Condensation",
      "Evaporation",
      "Freezing"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Evaporation is the process where liquid water turns into water vapor (gas) and disappears into the air."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "A butterfly starts its life as an egg.",
      "The pupa stage is when the caterpillar eats a lot of food.",
      "The larva hatches from the egg.",
      "An adult butterfly lays eggs to continue the life cycle."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The pupa stage (chrysalis) is a resting stage where the caterpillar transforms into a butterfly. It does not eat during this stage. The larva (caterpillar) is the stage that eats a lot."
  },
  {
    "questionText": "Four pupils made the following statements about magnets. Who made the CORRECT statement?",
    "options": [
      "Ali: Magnets attract all types of metal.",
      "Ben: Magnets can attract through any material.",
      "Caili: The strength of a magnet decreases over time.",
      "David: Magnets only attract other magnets."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Magnets lose their magnetism over time, hence Caili is correct. Magnets only attract specific metals like iron, cobalt, and nickel. They cannot attract through all materials and can attract other magnets or specific metals."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of living things?",
    "options": [
      "They reproduce.",
      "They need air, food, and water.",
      "They move from place to place.",
      "They respond to changes."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all living things move from place to place. Plants, for example, generally stay rooted in one location. All living things need air, food and water, reproduce, and respond to changes in their environment."
  },
  {
    "questionText": "Which of the following materials is the MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Wood is a poor conductor of heat, making it suitable for a cooking pot handle. This prevents burns. Metal and glass are good conductors of heat. Some plastics can melt when exposed to high temperatures."
  },
  {
    "questionText": "Which of the following statements about the Sun is true?",
    "options": [
      "The Sun is a planet.",
      "The Sun is the largest star in the universe.",
      "The Sun provides light and heat to the Earth.",
      "The Sun revolves around the Earth."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The Sun is a star that provides light and heat to the Earth, which is essential for life. The Earth revolves around the Sun. The Sun is not the largest star in the universe. It is only the largest in our solar system."
  },
  {
    "questionText": "Which of the following adaptations helps a cactus plant survive in a desert environment?",
    "options": [
      "Broad leaves to capture more sunlight.",
      "Brightly colored flowers to attract insects.",
      "A thick stem to store water.",
      "Long roots to absorb water from the air."
    ],
    "correctAnswerIndex": 3,
    "explanation": "A cactus plant's thick stem helps it store water, which is crucial for survival in a dry desert environment. Cacti have roots which spread far and wide to absorb as much water as possible from the soil."
  },
  {
    "questionText": "Which of the following shows the correct order of the life cycle of a chicken?",
    "options": [
      "Egg → Chick → Young Chicken → Adult Chicken",
      "Chick → Egg → Young Chicken → Adult Chicken",
      "Young Chicken → Egg → Chick → Adult Chicken",
      "Egg → Young Chicken → Chick → Adult Chicken"
    ],
    "correctAnswerIndex": 0,
    "explanation": "The correct order is Egg → Chick → Young Chicken → Adult Chicken. A chicken lays an egg, the egg hatches into a chick, the chick grows into a young chicken, and finally, the young chicken matures into an adult chicken."
  },
  {
    "questionText": "What is the main function of the roots of a plant?",
    "options": [
      "To produce food for the plant.",
      "To support the plant and absorb water and nutrients.",
      "To attract insects for pollination.",
      "To carry water and nutrients to the leaves."
    ],
    "correctAnswerIndex": 1,
    "explanation": "The roots of a plant primarily function to anchor the plant in the ground and absorb water and nutrients from the soil. Leaves produce food. Flowers attract insects for pollination and the stem supports water and nutrients to the leaves."
  },
  {
    "questionText": "Which of the following objects would be best for observing small insects in detail?",
    "options": [
      "Telescope",
      "Binoculars",
      "Microscope",
      "Magnifying glass"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A magnifying glass is best for observing small insects in greater detail. Microscopes are used for very tiny objects. Telescopes are for looking at far away objects like stars. Binoculars are to see far distances with both eyes."
  },
  {
    "questionText": "Which of the following actions would BEST conserve water?",
    "options": [
      "Taking long showers.",
      "Watering plants during the hottest part of the day.",
      "Fixing leaky faucets promptly.",
      "Washing clothes with small loads frequently."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fixing leaky faucets promptly prevents water wastage, conserving water. Taking long showers and washing clothes frequently use more water. Watering during the hottest part of the day results in water loss due to evaporation."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "The larva stage is when the butterfly eats the most.",
      "The pupa stage is a resting stage where the larva transforms.",
      "The adult butterfly lays its eggs on any surface.",
      "The egg hatches into a larva."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Butterflies typically lay their eggs on specific host plants that will provide food for the larva when it hatches. Therefore, laying eggs on 'any surface' is incorrect."
  },
  {
    "questionText": "A plant is placed in a dark room. Which of the following is MOST likely to happen to the plant after a week?",
    "options": [
      "It will grow taller and have greener leaves.",
      "It will grow taller and have paler leaves.",
      "It will grow shorter and have greener leaves.",
      "It will grow shorter and have paler leaves."
    ],
    "correctAnswerIndex": 1,
    "explanation": "In the dark, plants cannot perform photosynthesis efficiently. It will still try to grow (taller) to reach for light, but because it lacks chlorophyll production due to the absence of light, its leaves will become paler."
  },
  {
    "questionText": "Which of the following materials is the MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal, because it is a good conductor of heat.",
      "Glass, because it is transparent.",
      "Plastic, because it is a poor conductor of heat.",
      "Wood, because it is a good conductor of electricity."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plastic is a poor conductor of heat, meaning it does not easily allow heat to pass through it. This makes it suitable for a cooking pot handle to prevent burns."
  },
  {
    "questionText": "Which of the following activities would MOST likely cause the MOST amount of water pollution in a river?",
    "options": [
      "Swimming in the river.",
      "Washing clothes with soap in the river.",
      "Fishing in the river.",
      "Boating on the river."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Washing clothes with soap introduces chemicals into the river, causing water pollution. Swimming, fishing, and boating have minimal impact compared to the chemicals from the soap."
  },
  {
    "questionText": "Which of the following statements about magnets is FALSE?",
    "options": [
      "Magnets attract magnetic materials.",
      "Magnets have two poles, a north and a south.",
      "Like poles of magnets attract each other.",
      "Magnets can be used to separate mixtures."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Like poles of magnets (e.g., North-North or South-South) repel each other, not attract. Opposite poles attract each other."
  },
  {
    "questionText": "Which of the following changes of state involves a DECREASE in heat?",
    "options": [
      "Melting",
      "Boiling",
      "Condensation",
      "Evaporation"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Condensation is when a gas turns into a liquid, releasing heat into the surroundings. Melting, boiling, and evaporation require an increase in heat."
  },
  {
    "questionText": "Which of the following best describes the function of the roots of a plant?",
    "options": [
      "To absorb sunlight for photosynthesis.",
      "To transport water and minerals to the leaves.",
      "To produce fruits and seeds.",
      "To anchor the plant in the soil and absorb water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The primary functions of roots are to anchor the plant and absorb water and minerals from the soil. While they indirectly contribute to the transportation of water and minerals, their main role is absorption and anchorage."
  },
  {
    "questionText": "Which animal is a mammal and breathes through gills when young?",
    "options": [
      "Dolphin",
      "Shark",
      "Whale",
      "Platypus"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Platypuses are mammals that lay eggs. When they are young (puggle), they require gills for breathing in their semi-aquatic habitat. This is a unique characteristic among mammals."
  },
  {
    "questionText": "Which of these actions demonstrates the BEST way to conserve water?",
    "options": [
      "Taking long showers every day.",
      "Watering plants during the hottest part of the day.",
      "Fixing leaky taps promptly.",
      "Leaving the tap running while brushing your teeth."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Fixing leaky taps prevents unnecessary water wastage, which is the most direct way to conserve water compared to the other options which waste water."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They need air.",
      "They can reproduce.",
      "They need water.",
      "They can make their own food."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Not all living things can make their own food (e.g., animals). Plants can make their own food through photosynthesis, but animals rely on consuming other organisms. All living things need air and water and can reproduce."
  },
  {
    "questionText": "Which of the following statements about the life cycle of a butterfly is INCORRECT?",
    "options": [
      "The larva spends most of its time eating and growing.",
      "The pupa is a resting stage where significant changes occur.",
      "The adult butterfly lays its eggs near a source of nectar.",
      "The egg hatches into a small adult butterfly."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The egg hatches into a larva (caterpillar), not a small adult butterfly. The larva then goes through the pupa stage before becoming an adult butterfly."
  },
  {
    "questionText": "A group of pupils set up an experiment to find out if plants need sunlight to grow. They used two similar plants, A and B. Plant A was placed near a window, and Plant B was placed in a dark cupboard. Which of the following variables was NOT kept the same?",
    "options": [
      "Type of plant",
      "Amount of water given",
      "Amount of sunlight received",
      "Type of soil used"
    ],
    "correctAnswerIndex": 2,
    "explanation": "To ensure a fair test, all variables except the one being tested (sunlight) should be kept the same. The amount of sunlight was deliberately changed in this experiment."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the handle of a cooking pot and why?",
    "options": [
      "Metal, because it is a good conductor of heat.",
      "Wood, because it is a poor conductor of heat.",
      "Glass, because it is transparent.",
      "Plastic, because it is waterproof."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Wood is a poor conductor of heat, so it will not get too hot to hold when the pot is heated. This makes it a suitable material for a cooking pot handle."
  },
  {
    "questionText": "Which of the following statements about fungi is TRUE?",
    "options": [
      "All fungi are harmful and cause diseases.",
      "Fungi can only grow in sunlight.",
      "Some fungi are edible and can be used as food.",
      "Fungi do not need water to survive."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Some fungi, like mushrooms, are edible and are used as food. Other fungi can be harmful, but not all are."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of living things?",
    "options": [
      "They can reproduce.",
      "They need air, food and water.",
      "They can move from place to place.",
      "They can grow and die."
    ],
    "correctAnswerIndex": 2,
    "explanation": "While many living things can move from place to place, it is not a characteristic of all living things (e.g., plants). All living things need air, food, and water; can reproduce; and can grow and die."
  },
  {
    "questionText": "What happens to our shadow when we move closer to a light source?",
    "options": [
      "It gets longer.",
      "It gets shorter.",
      "It stays the same size.",
      "It disappears."
    ],
    "correctAnswerIndex": 1,
    "explanation": "When we move closer to a light source, our shadow gets shorter because the light is blocked from a larger area behind us relative to our size."
  },
  {
    "questionText": "Which of these objects is LEAST likely to be magnetic?",
    "options": [
      "A steel nail",
      "A copper coin",
      "An iron rod",
      "A refrigerator door"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Copper is not a magnetic material. Steel and iron are, and refrigerator doors often have magnetic strips to help them close."
  },
  {
    "questionText": "A toy car is placed on different surfaces. On which surface would the car travel the furthest with the same initial push?",
    "options": [
      "Rough carpet",
      "Smooth wooden floor",
      "Sandy beach",
      "Grassy field"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The smooth wooden floor offers the least friction, allowing the car to travel the furthest with the same push. Rougher surfaces like carpet, sand and grass increase friction and slow the car down faster."
  },
  {
    "questionText": "Why is it important to wash our hands before eating?",
    "options": [
      "To make our hands look clean.",
      "To make our hands smell good.",
      "To remove harmful germs that can cause illness.",
      "To make our hands feel cool."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Washing our hands before eating removes harmful germs (microorganisms) that may be present on our hands. These germs can cause illness if ingested with food."
  },
  {
    "questionText": "Which part of a plant is responsible for absorbing water and nutrients from the soil?",
    "options": [
      "Leaves",
      "Stem",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "The roots of a plant are responsible for absorbing water and nutrients from the soil. The leaves perform photosynthesis, the stem provides support and transport, and the flowers are for reproduction."
  },
  {
    "questionText": "Which of the following statements BEST explains why plants need sunlight?",
    "options": [
      "To absorb water from the soil.",
      "To keep their leaves warm.",
      "To make their own food through photosynthesis.",
      "To attract insects for pollination."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Plants use sunlight, along with carbon dioxide and water, to produce their own food through photosynthesis. This process provides them with the energy they need to grow and survive."
  },
  {
    "questionText": "A group of pupils observed a snail moving slowly across a leaf. Which characteristic of living things is BEST demonstrated by the snail's movement?",
    "options": [
      "Living things can reproduce.",
      "Living things can grow.",
      "Living things can respond to changes.",
      "Living things can move by themselves."
    ],
    "correctAnswerIndex": 3,
    "explanation": "The snail moving across the leaf demonstrates that living things can move by themselves. This is one of the key characteristics that differentiates living things from non-living things."
  },
  {
    "questionText": "Which of the following materials is MOST suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Wood is the most suitable material because it is a poor conductor of heat. This means it doesn't get too hot to hold when the pot is being used on the stove. Plastic can melt, metal and glass will get too hot."
  },
  {
    "questionText": "Which of the following changes is NOT reversible?",
    "options": [
      "Melting of ice",
      "Boiling of water",
      "Burning of paper",
      "Freezing of water"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Burning paper is an irreversible change because it results in the formation of new substances (ash, smoke, gases) and you cannot easily turn ash back into paper."
  },
  {
    "questionText": "Four different objects, A, B, C, and D, were placed in a container of water. Only objects A and B floated. What can you conclude about objects C and D?",
    "options": [
      "Objects C and D are heavier than objects A and B.",
      "Objects C and D are lighter than objects A and B.",
      "Objects C and D are able to absorb more water.",
      "Objects C and D are denser than water."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Objects that sink are denser than water, while objects that float are less dense than water. The density determines whether an object will sink or float."
  },
  {
    "questionText": "Aisha placed a slice of bread in a sealed plastic bag. After a few days, she observed mold growing on the bread. Which of the following conditions was MOST likely present inside the bag that allowed the mold to grow?",
    "options": [
      "Lack of air",
      "Lack of moisture",
      "Presence of light",
      "Presence of moisture"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Mold needs moisture (water) to grow. The sealed bag likely trapped some moisture, providing a suitable environment for the mold to thrive."
  },
  {
    "questionText": "Which of the following actions will MOST likely help to conserve water?",
    "options": [
      "Taking long showers",
      "Watering plants during the hottest part of the day",
      "Using a washing machine with a full load of clothes",
      "Leaving the tap running while brushing teeth"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Using a washing machine with a full load reduces the number of times you need to wash clothes, thus saving water. The other options waste water."
  },
  {
    "questionText": "Which of the following statements is TRUE about the life cycle of a butterfly?",
    "options": [
      "The larva looks exactly like the adult butterfly.",
      "The pupa is an active feeding stage.",
      "The egg hatches into a larva.",
      "The adult butterfly lays eggs that hatch into pupae."
    ],
    "correctAnswerIndex": 2,
    "explanation": "The life cycle of a butterfly consists of four stages: egg, larva (caterpillar), pupa (chrysalis), and adult butterfly. The egg hatches into a larva."
  },
  {
    "questionText": "Which of the following is NOT a function of our skeletal system?",
    "options": [
      "To produce digestive juices",
      "To protect internal organs",
      "To provide support for the body",
      "To allow movement"
    ],
    "correctAnswerIndex": 0,
    "explanation": "The skeletal system provides support, protection, and allows movement. Producing digestive juices is a function of the digestive system, not the skeletal system."
  },
  {
    "questionText": "Which of these animals is MOST likely to live in a desert environment?",
    "options": [
      "Penguin",
      "Camel",
      "Polar bear",
      "Frog"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Camels are well-adapted to desert environments. They can survive for long periods without water and have adaptations to cope with the hot temperatures."
  },
  {
    "questionText": "Which of the following statements about fungi is INCORRECT?",
    "options": [
      "Some fungi are used to make food.",
      "Fungi can reproduce through spores.",
      "All fungi are harmful and cause diseases.",
      "Fungi obtain nutrients from dead organisms."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all fungi are harmful. Some are beneficial and used in food production (e.g., mushrooms, yeast)."
  },
  {
    "questionText": "A group of pupils observed that a slice of bread left in a damp, dark place developed mould faster than a slice left in a dry, bright place. Which of the following variables was NOT controlled in this experiment?",
    "options": [
      "Type of bread",
      "Size of bread",
      "Amount of light",
      "Amount of water"
    ],
    "correctAnswerIndex": 3,
    "explanation": "The amount of water was not controlled. One bread slice was damp, and the other was dry. Thus, the independent variable (dampness) affected mould growth."
  },
  {
    "questionText": "Which of the following is NOT a characteristic of all living things?",
    "options": [
      "They can reproduce.",
      "They need air to breathe.",
      "They can grow.",
      "They can respond to changes."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Not all living things need air to breathe in the same way. Some organisms, like plants underwater or anaerobic bacteria, have different ways of obtaining energy or surviving without atmospheric air."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Wood",
      "Glass",
      "Plastic"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Wood is a poor conductor of heat, making it suitable for a pot handle to prevent burns. Metal, glass, and some plastics conduct heat well."
  },
  {
    "questionText": "Which of the following actions would NOT help to conserve water?",
    "options": [
      "Watering plants during the hottest part of the day.",
      "Taking shorter showers.",
      "Fixing leaky taps promptly.",
      "Reusing water for watering plants."
    ],
    "correctAnswerIndex": 0,
    "explanation": "Watering plants during the hottest part of the day leads to significant water loss through evaporation, making it an ineffective conservation method."
  },
  {
    "questionText": "Which part of a plant is responsible for absorbing the most amount of water?",
    "options": [
      "Stem",
      "Leaves",
      "Roots",
      "Flowers"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Roots are specifically designed to absorb water and nutrients from the soil. While other plant parts may absorb some water, the primary function of absorption lies with the roots."
  },
  {
    "questionText": "Which of the following animals lays eggs in water?",
    "options": [
      "Cat",
      "Dog",
      "Chicken",
      "Frog"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Frogs are amphibians, and their eggs need to be laid in water for the tadpoles to develop."
  },
  {
    "questionText": "A student wants to find out if the amount of sunlight affects the height of a bean plant. Which of the following should he keep the same?",
    "options": [
      "Amount of water given to the plant",
      "Amount of sunlight the plant receives",
      "Height of the plant",
      "Type of soil used"
    ],
    "correctAnswerIndex": 3,
    "explanation": "To ensure a fair test, all other variables except the amount of sunlight (the independent variable) must be kept constant. Using the same type of soil is a controlled variable."
  },
  {
    "questionText": "Which of the following statements about magnets is TRUE?",
    "options": [
      "Magnets only attract metal objects.",
      "Magnets attract all types of metal.",
      "Magnets always have one pole.",
      "Magnets can attract or repel other magnets."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Magnets have two poles (north and south) and can attract or repel other magnets depending on which poles are facing each other. They only attract certain metals like iron and nickel."
  },
  {
    "questionText": "Which of these actions demonstrates the concept of reducing friction?",
    "options": [
      "Wearing rubber-soled shoes on a slippery floor.",
      "Adding oil to a bicycle chain.",
      "Pushing a heavy box across a rough surface.",
      "Using sandpaper to smooth a piece of wood."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Adding oil to a bicycle chain reduces friction between the chain and the gears, allowing for smoother movement. The other options increase or utilize friction."
  },
  {
    "questionText": "A group of students observed a snail in their garden. They made the following statements:\n\nA: It moves very slowly.\nB: It has a shell.\nC: It eats leaves.\nD: It responds to touch.\n\nWhich of these statements show that the snail is a living thing?",
    "options": [
      "A and B only",
      "A, C and D only",
      "B and C only",
      "A, B, C and D"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Living things move, eat, and respond to stimuli. Having a shell is a characteristic but doesn't necessarily prove it's alive. Therefore, A, C, and D demonstrate that the snail is a living thing."
  },
  {
    "questionText": "Which of the following materials is most suitable for making the handle of a cooking pot?",
    "options": [
      "Metal",
      "Glass",
      "Wood",
      "Plastic"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Wood is a poor conductor of heat, so it will not get too hot to hold when the pot is heated. Metal and Glass are good conductors of heat and would become too hot. Some plastics melt at high temperatures."
  },
  {
    "questionText": "Which of the following statements about magnets is incorrect?",
    "options": [
      "Magnets can attract magnetic materials through air.",
      "Magnets can attract magnetic materials through water.",
      "All metals are attracted to magnets.",
      "A magnet has two poles, a north pole and a south pole."
    ],
    "correctAnswerIndex": 2,
    "explanation": "Not all metals are attracted to magnets. Only magnetic materials such as iron, nickel, and cobalt are attracted to magnets. Other metals like aluminum and copper are not."
  },
  {
    "questionText": "Study the classification table below:\n\n| Group X | Group Y |\n|---|---| \n| Bird | Butterfly |\n| Fish | Ant |\n| Snake | Bee |\n\nWhich of the following is a suitable heading for Group X and Group Y?",
    "options": [
      "| Group X: Can Fly | Group Y: Cannot Fly |",
      "| Group X: Lay Eggs | Group Y: Do Not Lay Eggs |",
      "| Group X: Animals with Backbones | Group Y: Animals without Backbones |",
      "| Group X: Land Animals | Group Y: Air Animals |"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Birds, fish, and snakes have backbones (vertebrates). Butterflies, ants, and bees do not have backbones (invertebrates)."
  },
  {
    "questionText": "A plant was placed in a dark room for a week. After a week, its leaves turned yellow. Which of the following explains this observation?",
    "options": [
      "The plant did not get enough water.",
      "The plant did not get enough sunlight to make food.",
      "The plant was too cold.",
      "The plant was attacked by insects."
    ],
    "correctAnswerIndex": 1,
    "explanation": "Plants need sunlight to perform photosynthesis and create food. Without sunlight, the chlorophyll (which makes the leaves green) breaks down, causing the leaves to turn yellow."
  },
  {
    "questionText": "Which of the following objects can produce its own light?",
    "options": [
      "The Moon",
      "A Mirror",
      "A Star",
      "A polished metal spoon"
    ],
    "correctAnswerIndex": 3,
    "explanation": "A star produces its own light through nuclear fusion. The Moon, a mirror, and a polished metal spoon reflect light from other sources."
  },
  {
    "questionText": "Four different cups were filled with the same amount of ice. Which cup will cause the ice to melt the fastest?",
    "options": [
      "A cup made of thick wool",
      "A cup made of thin plastic",
      "A cup made of thick ceramic",
      "A cup made of thin metal"
    ],
    "correctAnswerIndex": 3,
    "explanation": "Metal is a good conductor of heat. A thin metal cup allows heat from the surroundings to reach the ice more quickly, causing it to melt faster than the other options, which are insulators."
  },
  {
    "questionText": "Which of the following statements about fungi is correct?",
    "options": [
      "All fungi are harmful.",
      "Fungi can make their own food.",
      "Fungi reproduce by seeds.",
      "Some fungi are edible."
    ],
    "correctAnswerIndex": 3,
    "explanation": "Some fungi, like mushrooms, are edible. Fungi cannot make their own food; they are decomposers. Fungi reproduce by spores, not seeds. Not all fungi are harmful, some are useful in food production."
  }
]